[
  {
    "domain_name": "Domain 6: Interprofessional Partnerships",
    "progression_indicators": [
      "Communicate in a manner that facilitates a partnership approach to quality care delivery.",
      "Articulate the nurse’s scope of practice, core responsibilities, and unique contributions to patient care in interactions with patients, families, and interprofessional team members.",
      "Incorporate nursing’s role in collaborative care plans, ensuring clarity and understanding of nursing contributions in optimizing patient outcomes.",
      "Utilize standardized communication tools and techniques to convey patient information accurately and concisely during handoffs and team discussions.",
      "Adapt communication tools to the context and audience.",
      "Describe interprofessional team perspectives during care planning discussions.",
      "Incorporate team member’s perspectives to inform person-centered care decision-making.",
      "Identify how individual cultural backgrounds, biases, and communication styles influence interactions within interprofessional teams and impact patient care.",
      "Implement inclusive communication strategies.",
      "Document and share information using standardized communication tools concisely and respectfully within required timeframes.",
      "Contribute concise, accurate information in a professional manner to facilitate timely decision-making and continuity of care.",
      "Identify relevant legal, regulatory, and policy guidelines for interprofessional communication.",
      "Incorporate legal and policy guidelines into clinical communication.",
      "Analyze the strengths and limitations of interprofessional communication tools and techniques within specific team-based scenarios.",
      "Systematically assess and refine interprofessional communication through data-driven evaluation, incorporating stakeholder feedback and evidence-based practices.",
      "Use basic protocols to enhance clarity and reduce errors in interprofessional information exchange.",
      "Evaluate the effectiveness of existing interprofessional communication and take necessary action.",
      "Apply basic inclusive communication strategies within interprofessional teams.",
      "Evaluate and refine communication practices to promote a culture of respect in interprofessional teams.",
      "Apply nursing-specific knowledge when contributing to interprofessional care plans.",
      "Advocate for the integration of nursing’s unique disciplinary knowledge within interprofessional decision-making.",
      "Use of evidence-based resources to inform consultations.",
      "Develop advanced practice guidelines or protocols to guide consultations and improve interprofessional outcomes.",
      "Apply conflict resolution strategies in interprofessional teams to address and resolve disagreements effectively.",
      "Create and implement evidence-based conflict resolution protocols for interprofessional teams.",
      "Apply principles of team dynamics, including team roles, to facilitate effective team functioning.",
      "Describe the roles of various team members and reflect on how each role contributes to patient-centered care.",
      "Communicate with team members by actively listening, asking relevant questions, and seeking clarification to understand team dynamics and the role of nursing within the care team.",
      "Employ effective communication techniques to coordinate care, clarify expectations, and address challenges in team dynamics to enhance collaborative outcomes.",
      "Engage in interprofessional discussions, ensuring that all voices, including those of patients and family members, are considered to facilitate balanced decision-making in patient care.",
      "Identify specific tasks aligning with each team member’s responsibilities to support safe, effective care.",
      "Articulate how task allocation contributes to team efficiency and patient-centered outcomes.",
      "Delegate tasks according to the scope of practice, expertise, and workload.",
      "Evaluate the effectiveness of delegated tasks and adjust assignments as needed.",
      "Identify responsibilities within the larger team dynamic.",
      "Recognize the importance of working within one's scope of practice to support patient safety and team effectiveness.",
      "Demonstrate accountability for performing assigned tasks while seeking input from other professionals when needed.",
      "Describe personal qualities influencing interprofessional relationships.",
      "Articulate personal insights and experiences to enhance team dynamics.",
      "Identify examples of effective leadership that promotes safety and quality care.",
      "Participate in team debrief to identify actions impacting safety and quality.",
      "Participate in team debriefs to identify actions impacting safety and quality.",
      "Assess team performance and recommend improvements to enhance quality and patient safety.",
      "Explain evidence-based strategies relevant to team functioning.",
      "Describe the impact of evidence-based team practices on patient outcomes.",
      "Initiate the use of evidence-based checklists or protocols to streamline workflows.",
      "Describe factors of team dynamics affecting patient outcomes.",
      "Identify strategies to optimize team dynamics.",
      "Analyze team communication patterns and collaboration effectiveness.",
      "Evaluate how team performance and collaboration contribute to patient care outcomes.",
      "Identify how their role made specific contributions to team performance.",
      "Discuss personal accountability for enhancing team performance among team members.",
      "Identify behaviors and attitudes promoting a positive team culture.",
      "Reinforce positive behaviors and team cohesion by acknowledging team members’ efforts and outcomes.",
      "Describe the roles and responsibilities of each healthcare professional.",
      "Coordinate patient care through interdisciplinary collaboration.",
      "Identify how the unique abilities of each team member contribute to improved patient outcomes.",
      "Apply knowledge of interprofessional roles to strategically align tasks with strengths.",
      "Define team members’ responsibilities in executing a plan of care.",
      "Coordinate with team members to ensure the successful implementation of the plan.",
      "Provide input on team goals.",
      "Analyze how one’s contributions supported the team’s progress and desired outcomes.",
      "Design and guide collaborative processes.",
      "Manage team dynamics and logistics to ensure effectiveness.",
      "Explain the impact of bias on team function.",
      "Describe the concepts of implicit bias.",
      "Identify personal biases and apply bias mitigation strategies.",
      "Describe the expertise of other healthcare professionals.",
      "Describe the value of diverse perspectives within the healthcare team.",
      "Identify potential sources of conflict within the interprofessional team and seek guidance from an instructional team.",
      "Employ active listening and respectful communication techniques to resolve conflicts.",
      "Observe interprofessional/family team conferences.",
      "Contribute to a care conference with the patient, family, and interprofessional team members to establish shared goals and a coordinated plan of care.",
      "Reflect on personal experiences and interactions with interprofessional team members, documenting insights into potential biases and their impact on communication and collaboration.",
      "Integrate self-assessment strategies into practice, seeking feedback from colleagues and mentors to identify and address unconscious biases affecting interprofessional relationships.",
      "Encourage interprofessional team members to share their perspectives during case discussions, actively listening to diverse viewpoints, and facilitating respectful dialogue.",
      "Create interprofessional learning opportunities that promote collaborative problem-solving and knowledge exchange.",
      "Assess team dynamics for potential barriers to inclusivity.",
      "Advocate for policies and practices promoting diversity, equity, and inclusion within the interprofessional team and healthcare environment.",
      "Apply conflict resolution strategies between interprofessional team members, facilitating a respectful discussion to identify common ground and potential solutions.",
      "Initiate a conflict resolution process with team members.",
      "Participate in interprofessional learning activities.",
      "Design a professional development opportunity for healthcare professionals."
    ],
    "source_file": "Domain-6-Progression-Indicators-Both.pdf"
  },
  {
    "domain_name": "Domain 9: Professionalism",
    "progression_indicators": [
      "Demonstrate an ethical comportment in one’s practice reflective of nursing’s mission to society.",
      "Apply principles of professional nursing ethics and human rights in patient care and professional situations.",
      "Identify potential ethical issues in patient care scenarios and articulate the principles of professional nursing ethics and human rights.",
      "Acknowledge diverse patient values, cultural backgrounds, and preferences when discussing care options, demonstrating respect for human dignity.",
      "Seek guidance from instructors or mentors when faced with ethical dilemmas, demonstrating an awareness of limitations in knowledge or experience.",
      "Make ethical decisions while advocating for and delivering non-discriminatory, respectful care that upholds patient autonomy, confidentiality, and informed decision-making.",
      "Resolve ethical dilemmas in collaboration with healthcare team members, using evidence-based frameworks and professional guidelines to guide decision-making.",
      "Model professional comportment by consistently integrating ethical principles into interactions with patients, families, and colleagues, promoting a culture of respect and accountability.",
      "Reflect on one’s actions and their consequences.",
      "Describe specific actions and identify how individual actions impact patient outcomes or team dynamics.",
      "Seek constructive feedback from instructors or peers to gain insight into areas for improvement in professional practice.",
      "Acknowledge mistakes or missed opportunities during care delivery and explore strategies for improvement.",
      "Analyze decisions, linking them to evidence-based practices and ethical considerations to identify strengths and areas for growth.",
      "Adapt future actions by incorporating critical feedback and lessons from previous experiences, demonstrating accountability and a commitment to continuous improvement.",
      "Engage in reflective discussions with peers and mentors, articulating how personal and professional growth supports effective patient care and teamwork.",
      "Demonstrate ethical behaviors in practice.",
      "Identify situations requiring ethical decision-making and describe appropriate actions to uphold ethical principles.",
      "Follow established protocols and guidelines to ensure compliance with legal and ethical standards in patient care.",
      "Acknowledge ethical dilemmas and seek guidance from instructors or mentors to understand appropriate courses of action.",
      "Apply ethical principles consistently in clinical decision-making, ensuring patient care aligns with professional nursing standards and values.",
      "Advocate for patients’ rights and well-being when ethical concerns arise.",
      "Demonstrate integrity and accountability by addressing unethical practices or behaviors observed in clinical settings, utilizing appropriate channels for reporting and resolution.",
      "Change behavior based on self and situational awareness.",
      "Recognize personal emotions, biases, or stress levels during clinical experiences and describe their potential impact on interactions with patients or team members.",
      "Adjust communication style or approach when responding to feedback or observing changes in patient needs or care priorities.",
      "Seek input from peers or instructors to identify specific actions or behaviors that could improve performance in different situations.",
      "Adapt real-time clinical practices and communication strategies to align with dynamic patient care needs, team dynamics, and environmental factors.",
      "Demonstrate proactive problem-solving and flexibility by modifying approaches to address challenges or unexpected changes in clinical settings.",
      "Incorporate self-reflection and situational analysis into decision-making, consistently improving the quality of care and fostering positive professional relationships.",
      "Report unethical behaviors when observed.",
      "Recognize situations where behaviors or practices deviate from ethical standards, identifying potential risks to patients, colleagues, or the profession.",
      "Seek guidance from an instructor, mentor, or supervisor to confirm the unethical nature of observed behaviors and determine appropriate reporting channels.",
      "Document observations of unethical behaviors clearly and objectively, ensuring accuracy and professionalism in preparing to report the issue.",
      "Report unethical behaviors promptly and appropriately through established organizational or institutional channels, ensuring patient safety and professional integrity.",
      "Advocate for transparency and accountability by addressing the ethical implications of the reported behavior in collaboration with healthcare team members or supervisors.",
      "Support a culture of ethical practice by demonstrating professionalism and discretion.",
      "Safeguard privacy, confidentiality, and autonomy in all interactions.",
      "Describe the importance of maintaining patient privacy and confidentiality.",
      "Obtain patient consent before sharing information with family or non-healthcare team members, demonstrating respect for autonomy.",
      "Adhere to institutional policies and protocols regarding the secure handling of patient records, both digital and physical.",
      "Implement strategies to safeguard patient information.",
      "Advocate for patient autonomy by actively involving patients in care decisions and ensuring they fully understand and consent to interventions.",
      "Model professional behavior by upholding the highest confidentiality and privacy standards.",
      "Advocate for the individual’s right to self-determination.",
      "Explain the concept of self-determination to patients, ensuring they understand their rights to make informed decisions about their care.",
      "Respect patients’ preferences and values, even when they differ from the student’s beliefs or opinions.",
      "Seek guidance from instructors or mentors when navigating situations where a patient’s right to self-determination may conflict with clinical recommendations.",
      "Facilitate open and empathetic communication to support patients in expressing their values, goals, and preferences for care.",
      "Collaborate with healthcare team members to ensure that care plans align with the patient’s informed choices, addressing any barriers to self-determination.",
      "Analyze current policies and practices in the context of an ethical framework.",
      "Identify ethical principles relevant to healthcare policies or practices.",
      "Evaluate specific policies or practices to determine whether they align with professional nursing values and ethical guidelines.",
      "Appraise institutional or healthcare policies by applying ethical frameworks to identify gaps or inconsistencies in addressing patient rights or equity.",
      "Propose evidence-based recommendations to improve policies or practices, ensuring alignment with ethical standards and nursing values.",
      "Model ethical behaviors in practice and leadership roles.",
      "Demonstrate integrity and accountability by adhering to ethical guidelines in decision-making and patient care within clinical or leadership contexts.",
      "Engage in reflective and collaborative problem-solving, exploring ethical dilemmas.",
      "Foster a culture of trust and professionalism by consistently integrating ethical principles into clinical practice and team management.",
      "Apply ethical frameworks to real-world scenarios, demonstrating advanced understanding and commitment to professional values.",
      "Suggest solutions when unethical behaviors are observed.",
      "Identify the ethical principles violated when unethical behaviors are observed and describe their potential impact on patient care and professional integrity.",
      "Collaborate with instructors or mentors to develop appropriate strategies for addressing unethical behaviors constructively.",
      "Develop actionable, evidence-based solutions to address unethical behaviors, ensuring alignment with professional guidelines and organizational policies.",
      "Facilitate open discussions among team members to explore ethical concerns and collaboratively identify strategies to resolve issues and prevent recurrence.",
      "Assume accountability for working to resolve ethical dilemmas.",
      "Recognize the ethical dilemma and seek guidance from faculty, mentors, or institutional ethics committees to understand possible solutions and responsibilities.",
      "Reflect on personal values and biases when faced with ethical dilemmas, identifying how they may influence decision-making and patient care.",
      "Acknowledge the need for collaboration and seek input from interdisciplinary team members to help resolve ethical issues in patient care.",
      "Take initiative to identify and address ethical dilemmas in practice, assuming responsibility for navigating the issue and working toward a resolution in collaboration with others.",
      "Advocate for patient-centered care by considering all ethical perspectives and making decisions that align with professional values, patient autonomy, and best practices.",
      "Lead discussions on ethical dilemmas in team settings, facilitating critical thinking and providing evidence-based recommendations for resolution while assuming responsibility for the outcomes of decisions.",
      "Employ participatory approach to nursing care.",
      "Employ the use of intentional presence to facilitate shared meaning of the experience between nurse and recipient of care.",
      "Observe patients’ verbal and non-verbal cues and respond empathetically to foster a deeper understanding of their needs and concerns.",
      "Engage in active listening during patient interactions.",
      "Seek opportunities to refine communication skills to enhance patient-centered interactions.",
      "Demonstrate active, empathetic listening and mindfulness in patient interactions, ensuring patients feel heard and understood.",
      "Use verbal and non-verbal communication techniques to promote mutual understanding and clarify patient concerns.",
      "Foster trust and therapeutic relationships by being fully present, addressing both emotional and physical aspects of care in a manner that respects patient dignity and perspectives.",
      "Facilitate health and healing through compassionate caring.",
      "Exhibit empathy by acknowledging patients’ emotions and offering comfort through kind words and actions during care.",
      "Demonstrate attentiveness to patient needs by proactively offering assistance and reassurance throughout the care process.",
      "Provide holistic care by addressing the physical and emotional aspects of patient well-being, ensuring a therapeutic and compassionate presence.",
      "Advocate for patient comfort and well-being by anticipating needs, providing emotional support, and encouraging active participation in care decisions to promote empowerment and healing.",
      "Demonstrate empathy to the individual’s life experience.",
      "Seek to understand each patient’s unique perspectives and the potential impact of their experiences on care.",
      "Use empathetic statements to build rapport while maintaining professional boundaries.",
      "Align communication approaches with the patient’s emotional state and background, demonstrating cultural sensitivity and respect.",
      "Collaborate with patients to develop individualized care plans that reflect their values, experiences, and preferences.",
      "Recognize and respond to emotional or psychological distress by offering appropriate support and resources.",
      "Advocate for practices that advance diversity, equity, and inclusion.",
      "Acknowledge and respect patient differences, demonstrating awareness of diverse clinical needs.",
      "Ensure inclusive care practices by accommodating patients’ cultural, religious, and personal values.",
      "Promote equitable access to care by advocating for policies and practices that address social determinants of health.",
      "Foster an inclusive healthcare environment by championing diverse perspectives within healthcare teams and decision-making processes.",
      "Demonstrate cultural sensitivity and humility in practice.",
      "Engage in respectful conversations with patients to understand their cultural perspectives, values, and beliefs.",
      "Reflect on personal biases and recognize their impact on patient interactions.",
      "Adapt communication and care approaches to respect cultural norms and individual preferences.",
      "Integrate patients’ cultural practices into care plans while balancing clinical needs and evidence-based practice.",
      "Identify and address systemic barriers to culturally appropriate care, advocating for policy improvements where needed.",
      "Seek input from patients and families to ensure care aligns with their cultural values, demonstrating respect and humility throughout the process.",
      "Apply principles of therapeutic relationships and professional boundaries.",
      "Establish rapport with patients by demonstrating approachability and respect.",
      "Ensure that all interactions remain patient-centered, limit self-disclosure, and maintain professional focus.",
      "Communicate the nurse’s role to patients and families, reinforcing professional expectations.",
      "Maintain trust by consistently exhibiting reliability, empathy, and professionalism.",
      "Identify and address potential boundary violations.",
      "Uphold and reinforce professional boundaries when collaborating with patients, families, and interdisciplinary teams.",
      "Communicate in a professional manner.",
      "Use clear, concise, and respectful language in all communications with patients, families, and healthcare team members.",
      "Demonstrate active listening skills and ensure understanding in patient interactions.",
      "Document patient care and interactions using appropriate medical terminology and formats.",
      "Modify communication strategies to engage diverse audiences effectively.",
      "Address misunderstandings or conflicts with a respectful and solutions-focused approach.",
      "Provide constructive and actionable feedback to peers while fostering a supportive team environment.",
      "Foster opportunities for intentional presence in practice.",
      "Allocate dedicated time for focused, uninterrupted patient interactions to foster trust and enhance well-being.",
      "Use open body language and maintain eye contact to demonstrate engagement and attentiveness.",
      "Incorporate mindful presence into daily nursing practice, minimizing distractions during patient care.",
      "Model and share techniques for enhancing patient-centered interactions with colleagues and students.",
      "Organize workflows that support the integration of intentional presence in nursing practice.",
      "Identify innovative and evidence-based practices that promote person-centered care.",
      "Seek and appraise scholarly literature on evidence-based practices that enhance person-centered care.",
      "Participate in interdisciplinary projects to align care delivery with patients’ preferences and values.",
      "Explore emerging healthcare technologies that have the potential to enhance patient-centered care.",
      "Design and propose innovative care models or interventions tailored to patient needs and clinical contexts.",
      "Facilitate interdisciplinary team discussions to assess the effectiveness of implemented practices and refine them based on patient outcomes and feedback.",
      "Advocate for practices that advance diversity, equity, and inclusion.",
      "Identify and address disparities in healthcare access, outcomes, or treatment through team discussions and advocacy.",
      "Encourage the inclusion of diverse voices in care planning and policy development.",
      "Participate in ongoing education to enhance understanding of cultural humility and equity in healthcare.",
      "Model equitable health promotion practices in both clinical and educational settings.",
      "Implement strategies to mitigate bias and promote equitable patient care and interdisciplinary collaboration.",
      "Propose educational programs to support cultural humility and equity in healthcare.",
      "Model professional expectations for therapeutic relationships.",
      "Maintain clear professional boundaries by focusing interactions on patient-centered care.",
      "Take accountability for maintaining professional integrity in all patient interactions.",
      "Create a supportive and respectful care environment that prioritizes patient autonomy and collaboration.",
      "Reinforce professional behavior and expectations in therapeutic relationships and interdisciplinary collaboration.",
      "Address and resolve concerns that may compromise the therapeutic alliance.",
      "Advocate for institutional policies and educational initiatives that uphold professional standards in therapeutic relationships.",
      "Facilitate communication that promotes a participatory approach.",
      "Encourage individuals to share their goals, preferences, and concerns during care planning.",
      "Adjust communication techniques to meet the diverse needs of patients with varying health literacy or cultural backgrounds.",
      "Engage patients, families, and care teams in collaborative decision-making processes.",
      "Ensure that all stakeholders in the care process are effectively engaged and understand their roles.",
      "Advocate for healthcare systems and workflows that support participatory communication as a standard practice.",
      "Demonstrate accountability to the individual, society, and the profession.",
      "Engage in advocacy that promotes the best interest of the individual, community, and profession.",
      "Recognize situations where an individual’s or community’s needs are unmet and bring these to the attention of faculty or team members.",
      "Contribute to care planning conversations, prioritizing the best interests of patients or communities.",
      "Encourage patients to voice their needs and preferences during care planning while providing information to support informed decision-making.",
      "Advocate when care plans do not align with individual needs, using evidence-based reasoning to support recommendations.",
      "Facilitate connections between patients and appropriate community services or support networks to address broader determinants of health.",
      "Collaborate on initiatives or campaigns highlighting nursing’s role in advancing patient outcomes and public health.",
      "Demonstrate the moral courage to report concerns related to actual or potential hazards and/or errors.",
      "Identify potential hazards or errors in clinical settings and communicate these observations to a supervisor or faculty member.",
      "Seek advice from experienced professionals when unsure about the best course of action regarding a safety concern.",
      "Report actual or potential hazards, unsafe practices, or errors through appropriate channels without hesitation.",
      "Collaborate on initiatives to improve safety and minimize risk.",
      "Support a culture of openness by modeling and promoting the importance of speaking up about safety concerns.",
      "Demonstrate professional and personal honesty and integrity.",
      "Follow institutional and professional codes of conduct in all academic and clinical activities.",
      "Acknowledge errors promptly and honestly, seeking opportunities to learn from them.",
      "Identify components of ethical communication.",
      "Model ethical principles in personal and professional endeavors.",
      "Promote a culture of accountability by encouraging self and peers to take responsibility for their actions.",
      "Model consistent, transparent, and ethical communication.",
      "Take responsibility for one’s roles, decisions, obligations, actions, and care outcomes.",
      "Identify one’s role and responsibilities in the practice setting.",
      "Complete assigned duties efficiently and report to supervisors or team members as needed.",
      "Seek feedback to improve practice.",
      "Demonstrate accountability for all aspects of care delivery and patient outcomes.",
      "Evaluate the results of nursing actions, aiming to improve care delivery and outcomes.",
      "Incorporate constructive input to enhance performance.",
      "Engage in professional activities and/or organizations.",
      "Identify professional organizations relevant to nursing practice.",
      "Attend professional activities or organizational meetings aligned with professional development goals and areas of interest.",
      "Participate in public or community events related to the nursing profession.",
      "Demonstrate adherence to a culture of civility.",
      "Use courteous and professional language when interacting with patients, peers, and team members.",
      "Engage in active listening to support understanding of others’ preferences and beliefs.",
      "Recognize incivility and discuss concerns with the team.",
      "Demonstrate respect and professionalism in all interactions.",
      "Advocate for the resolution of incivility to foster mutual respect.",
      "Propose strategies to promote civility.",
      "Advocate for social justice and health equity, including addressing the health of vulnerable populations.",
      "Observe and report disparities in care delivery or outcomes among diverse patient populations.",
      "Participate in care practices that account for cultural, social, and economic differences.",
      "Propose policy or practice changes that address health inequities and promote access to care.",
      "Engage in peer evaluation.",
      "Assess peer performance and share observations in a supportive, non-judgmental manner.",
      "Accept feedback to inform professional development and skill enhancement.",
      "Integrate feedback to improve personal performance and understanding.",
      "Provide actionable feedback to peers, focusing on their professional growth.",
      "Advocate for nursing’s professional responsibility for ensuring optimal care outcomes.",
      "Discuss the role of evidence-based nursing standards in achieving optimal care outcomes during team meetings or case studies.",
      "Promote adherence to professional responsibilities that directly impact patient safety and care quality.",
      "Champion integration of nursing standards and guidelines into practice to improve care outcomes at the organizational or community level.",
      "Demonstrate leadership skills when participating in professional activities and/or organizations.",
      "Participate in professional activities and organizations to gain insight into leadership opportunities and decision-making processes.",
      "Share ideas and perspectives during discussions to ensure nursing’s voice is represented in professional forums.",
      "Assume leadership roles in professional, student, or academic settings related to a professional issue.",
      "Address actual or potential hazards and/or errors.",
      "Communicate observed safety risks or errors to appropriate team members to support timely resolution.",
      "Analyze adverse events to identify contributing factors and propose preventive strategies.",
      "Develop and integrate strategies into practice to mitigate identified hazards or errors.",
      "Advocate for evidence-based organizational changes to enhance patient safety and reduce errors.",
      "Foster a practice environment that promotes accountability for care outcomes.",
      "Articulate one’s role in contributing to patient outcomes.",
      "Monitor care outcomes and communicate areas for improvement to the team.",
      "Evaluate care outcomes and create improvement plans, emphasizing team accountability.",
      "Demonstrate consistency in personal and team accountability.",
      "Advocate for policies/practices that promote social justice and health equity.",
      "Recognize health inequities within patient populations.",
      "Evaluate organizational policies that address social determinants of health and reduce barriers to care.",
      "Integrate an understanding of systemic inequities in healthcare delivery and access into practice.",
      "Promote social justice with policymakers, organizations, and community leaders.",
      "Foster strategies that promote a culture of civility across a variety of settings.",
      "Recognize behaviors that undermine a respectful environment.",
      "Promote active listening and thoughtful communication during team discussions.",
      "Model mutual respect and understanding when confronted with conflict.",
      "Advocate for civility and proactively address incivility.",
      "Lead in the development of opportunities for professional and interprofessional activities.",
      "Participate in joint projects or committees that unite nursing with other healthcare disciplines.",
      "Suggest new ideas for collaborative activities that enhance professional growth across disciplines.",
      "Design a professional/interprofessional development activity.",
      "Comply with relevant laws, policies, and regulations.",
      "Advocate for policies that promote health and prevent harm.",
      "Evaluate healthcare policies and their impact on patient health.",
      "Contribute to efforts to influence healthcare policies to improve health.",
      "Adhere to the registered nurse scope and standards of practice.",
      "Discuss the registered nurse (RN) scope and standards of practice.",
      "Identify potential risks of violating the RN’s scope and standards of practice.",
      "Provide care that aligns with the RN's scope and standards of practice.",
      "Propose solutions to address risks of violating the RN’s scope and standards of practice.",
      "Adhere to regulatory requirements and workplace policies consistent with one’s educational preparation.",
      "Identify policies and regulatory requirements that guide nursing practice.",
      "Adhere to institutional, legal, and regulatory requirements.",
      "Advocate for policies that enable nurses to practice to the full extent of their education.",
      "Articulate barriers that limit nurses from practicing to the full scope of their education and training.",
      "Engage in academic or organizational dialogues about policy gaps that hinder advanced nursing practice.",
      "Investigate current policies affecting the nursing scope of practice and evaluate their alignment with professional competencies.",
      "Communicate with healthcare stakeholders on the importance of policy changes that allow nurses to utilize their full expertise.",
      "Advocate for adherence to scope-of-practice standards.",
      "Assess the interaction between regulatory agency requirements and quality, fiscal, and value-based indicators.",
      "Identify key regulatory requirements and their influence on quality metrics and healthcare costs.",
      "Review healthcare performance data to identify trends and correlations with regulatory compliance.",
      "Evaluate the impact of regulatory standards on financial outcomes.",
      "Assess how regulatory requirements impact an organization’s quality and value-based indicators.",
      "Propose evidence-based solutions to align regulatory compliance with enhanced patient outcomes and cost-effectiveness.",
      "Integrate regulatory standards with quality improvement initiatives to improve healthcare quality, fiscal responsibility, and value-based indicators.",
      "Evaluate the effect of legal and regulatory policies on nursing practice and healthcare outcomes.",
      "Identify how specific legal and regulatory policies influence nursing workflows and patient care delivery.",
      "Evaluate the implications of existing policies on healthcare outcomes.",
      "Analyze patient data to assess regulatory compliance’s direct and indirect effects on outcomes.",
      "Lead evaluations of legal and regulatory policies, providing actionable insights into their effects on nursing and patient care outcomes.",
      "Propose refinements to policies based on evidence of their impact on nursing practice and health outcomes.",
      "Use outcome data to advocate for policy changes that enhance nursing practice and patient care quality.",
      "Analyze efforts to change legal and regulatory policies that improve nursing practice and health outcomes.",
      "Research ongoing efforts to modify legal or regulatory policies related to nursing and healthcare.",
      "Review proposed policy changes, providing feedback on their potential to enhance nursing practice and health outcomes.",
      "Organize and lead initiatives to support changes in legal or regulatory policies that benefit nursing and healthcare.",
      "Evaluate implications of policy changes for nursing practice and health outcomes.",
      "Participate in the implementation of policies and regulations to improve the professional practice environment and healthcare outcomes.",
      "Participate in policy implementation within organizational settings.",
      "Recognize potential challenges in applying new policies or regulations in practice environments.",
      "Evaluate the implementation of new policies or regulations in organizational settings.",
      "Track adherence to newly implemented policies and evaluate their impact on practice environments and patient outcomes.",
      "Demonstrate the professional identity of nursing.",
      "Describe nursing’s professional identity and contributions to the healthcare team.",
      "Describe the key roles and responsibilities of nurses within the healthcare team.",
      "Articulate how nursing contributes to patient outcomes and team efficiency.",
      "Demonstrate the core values of professional nursing identity.",
      "Describe the core values of professional nursing.",
      "Model core values of professional nursing in practice.",
      "Demonstrate sensitivity to the values of others.",
      "Ask thoughtful, open-ended questions about the values and beliefs of others.",
      "Describe differences in cultural, social, and personal values.",
      "Integrate cultural awareness into communication and respect the preferences and values of others.",
      "Demonstrate ethical comportment and moral courage in decision making and actions.",
      "Describe ethical comportment in nursing.",
      "Describe moral courage in nursing.",
      "Explain how ethical comportment and moral courage influence decision-making.",
      "Adhere to the ANA Code of Ethics and institutional clinical policies.",
      "Use moral courage to address unethical practices or situations.",
      "Demonstrate emotional intelligence.",
      "Define emotional intelligence and its relevance to nursing practice.",
      "Describe the impact of emotional intelligence on nursing practice.",
      "Practice self-awareness and self-regulation in professional situations.",
      "Use emotional intelligence to mediate conflicts effectively.",
      "Articulate nursing’s unique professional identity to other interprofessional team members and the public.",
      "Describe the professional identity of nursing.",
      "Communicate the nursing profession's unique identity in policy discussions, public forums, or interdisciplinary collaborations.",
      "Evaluate practice environment to ensure that nursing core values are demonstrated.",
      "Assess the presence of core values in practice environments.",
      "Propose initiatives or interventions that enhance integrating nursing values within practice settings.",
      "Identify opportunities to lead with moral courage to influence team decision-making.",
      "Identify ethical challenges in nursing practice.",
      "Initiate conversations to address ethical challenges in nursing practice.",
      "Provide guidance and resources to team members to address ethical challenges.",
      "Engage in professional organizations that reflect nursing’s values and identity.",
      "Identify professional organizations that align with individual nursing practice interests.",
      "Sustain active student membership in a local, state, or national nursing professional organization.",
      "Engage in professional nursing organizations to support ongoing professional development and advocacy efforts.",
      "Integrate diversity, equity, and inclusion as core to one’s professional identity.",
      "Demonstrate respect for diverse individual differences and diverse communities and populations.",
      "Recognize cultural differences, values, beliefs, and preferences when interacting with patients and their families.",
      "Use language and tone that are inclusive and considerate of patients’ cultural or linguistic needs.",
      "Identify patients' unique backgrounds and experiences to provide individualized care.",
      "Integrate patients’ cultural, spiritual, and personal preferences into plans of care to meet their needs holistically.",
      "Advocate for patients and communities by leading initiatives that address health disparities.",
      "Demonstrate awareness of personal and professional values and conscious and unconscious biases.",
      "Identify conscious and unconscious biases.",
      "Articulate how personal values or biases affect professional practice.",
      "Seek guidance to support equitable care and reduce bias in practice.",
      "Incorporate strategies to mitigate personal biases.",
      "Compare how personal values align with or differ from professional expectations.",
      "Integrate core principles of social justice and human rights into practice.",
      "Identify social and structural factors that contribute to health disparities within patient populations.",
      "Treat all people with dignity and respect.",
      "Advocate for patient autonomy and informed decision-making.",
      "Mitigate social and structural factors that influence health disparities through informed care strategies.",
      "Integrate social justice principles into clinical decisions.",
      "Model respect for diversity, equity, and inclusion for all team members.",
      "Use respectful and culturally appropriate language in all interactions.",
      "Seek input from all team members to foster an inclusive decision-making process.",
      "Address biased comments or actions within the team through education and constructive dialogue.",
      "Develop and facilitate discussions to promote diversity, equity, and inclusion in healthcare.",
      "Collaborate to implement policies or practices that address inequities within healthcare systems.",
      "Critique one’s personal and professional practices in the context of nursing’s core values.",
      "Describe how nursing values are upheld in clinical practice.",
      "Set development goals to strengthen adherence to nursing values.",
      "Evaluate how personal and professional actions reflect nursing’s core values.",
      "Address gaps in adherence to nursing’s values.",
      "Implement strategies to align personal practice with professional values.",
      "Analyze the impact of structural and cultural influences on nursing’s professional identity.",
      "Identify how workplace policies and practices shape perceptions of nursing’s professional identity.",
      "Develop strategies to address structural or cultural barriers affecting professional identity.",
      "Ensure that care provided by self and others is reflective of nursing’s core values.",
      "Compare and contrast care delivery with nursing’s core values.",
      "Model nursing’s core values in care delivery, ensuring alignment with ethical and professional standards.",
      "Structure the practice environment to facilitate care that is culturally and linguistically appropriate.",
      "Recognize the need for culturally and linguistically appropriate care practices.",
      "Design and implement workflows or policies that ensure culturally and linguistically responsive care.",
      "Ensure self and others are accountable in upholding moral, legal, and humanistic principles related to health.",
      "Identify moral, legal, and ethical guidelines relevant to nursing practice.",
      "Recognize and address moral, legal, or ethical infractions in healthcare settings.",
      "Implement moral, legal, and ethical guidelines in professional practice.",
      "Seek guidance for addressing practice infractions to uphold ethical standards."
    ],
    "source_file": "Domain-9-Progression-Indicators-Both.pdf"
  },
  {
    "domain_name": "Domain 3: Population Health",
    "progression_indicators": [
      "Define a target population including its functional and problem-solving capabilities",
      "Describe the defining characteristics of a target population",
      "Identify demographic, functional, and educational characteristics within a specific target population",
      "Identify key sources of population health data",
      "Access pertinent population health data",
      "Evaluate population health data to determine health risks within an identified population",
      "Identify key stakeholders within a community",
      "Gather relevant assessment data to inform population health initiatives",
      "Collaborate with community members and leaders to develop a shared understanding of community health priorities",
      "Identify relevant health indicators across local, regional, national, and global contexts",
      "Compare health statistics across geographic regions to identify disparities and opportunities for intervention",
      "Analyze qualitative and quantitative data to identify emerging health trends and needs within a community",
      "Explain the role of the public health system in disease prevention, health promotion, and population protection",
      "Analyze the impact of public health interventions on clinical practice and population health outcomes",
      "Define the essential elements of an action plan using the nursing process",
      "Choose evidence-based nursing interventions to improve public health outcomes",
      "Integrate complex data and evidence to design actionable and sustainable plans for addressing population health issues",
      "Articulate the role of culture and language in patient care to enhance communication and demonstrate respect",
      "Collaborate with healthcare teams to implement culturally responsive nursing interventions",
      "Identify key developmental stages and age-related health issues within a population",
      "List age-appropriate interventions and communication techniques",
      "Apply evidence-based practices to address the unique needs of populations across the age continuum",
      "Explain core ethical principles in healthcare",
      "Articulate how ethical principles guide the protection of diverse populations' health and safety",
      "Identify key factors influencing a healthcare system's ability to meet population needs",
      "Use systematic assessment and data analysis to evaluate the healthcare system’s effectiveness in addressing specific population health needs",
      "Evaluate the quality and reliability of health data sources",
      "Identify relevant benchmarks for comparative analysis",
      "Apply data analysis techniques to identify trends, patterns, and disparities in health outcomes across populations",
      "Analyze the feasibility of various methods to determine population-focused care priorities",
      "Assess and adjust care priorities in response to population needs, emerging healthcare trends, and evolving scientific evidence",
      "Analyze complex organizational structures to build effective partnerships",
      "Evaluate the effectiveness of collaborative efforts to improve healthcare partnerships",
      "Contribute to the development of culturally responsive care strategies by integrating stakeholder input",
      "Lead collaborative efforts to implement and evaluate sociocultural and linguistically responsive interventions",
      "Participate in discussions with healthcare professionals about developing and implementing population health initiatives",
      "Collaborate with interdisciplinary teams to design, implement, and evaluate population health programs to enhance healthcare outcomes",
      "Demonstrate effective communication skills to facilitate collaboration",
      "Identify key elements of effective collaboration",
      "Model accountability for individual actions and contributions to team objectives",
      "Apply conflict management strategies to resolve disagreements constructively and maintain professional relationships",
      "Identify common cultural and linguistic barriers to healthcare delivery",
      "Apply culturally and linguistically appropriate communication strategies when interacting with patients and families",
      "Adapt communication styles to meet the needs of populations, ensuring inclusivity and effectiveness",
      "Collaborate with interpreters and translators to facilitate accurate and meaningful communication with populations",
      "Identify key stakeholders and health initiatives addressing the needs of specific populations",
      "Develop relationships with community organizations and healthcare providers to facilitate meaningful collaboration",
      "Develop and implement collaborative initiatives designed to improve population health outcomes",
      "Identify prevalent biases and stereotypes influencing healthcare delivery",
      "Challenge personal biases and stereotypes to enhance clinical judgment and decision-making",
      "Design and implement evidence-based interventions to mitigate biases and barriers to equitable healthcare",
      "Identify key factors contributing to successful and effective partnerships in healthcare",
      "Analyze outcome data related to partnership goals and assess the impact on health equity",
      "Develop and evaluate plans for the long-term sustainability of partnerships to ensure continued progress in addressing healthcare disparities",
      "Establish and nurture strong relationships with key stakeholders to promote collaboration",
      "Identify leadership roles within population health initiatives",
      "Apply leadership theories to enhance communication and teamwork",
      "Delegate tasks and responsibilities effectively to maximize efficiency and impact",
      "Assess team performance and make necessary adjustments to optimize outcome effectiveness",
      "Identify gaps in preparedness and response plans for both natural and manmade disasters",
      "Develop strategies to improve preparedness and response capabilities",
      "Lead collaborative efforts with partners to strengthen disaster response plans",
      "Mentor and coach partners in disaster preparedness and response",
      "Describe the potential effects of the proposed interventions",
      "Develop strategies to mitigate barriers and promote equitable access to interventions",
      "Define prioritization frameworks",
      "Identify the feasibility and urgency of potential action plans",
      "Select action plans based on evidence and available resources",
      "Choose the prioritization framework that is aligned with the context",
      "Collaborate with community partners to prioritize community needs",
      "Prioritize action plans that are population-centered and culturally appropriate",
      "Identify key factors to consider when evaluating the cost-effectiveness of interventions",
      "Compare the cost-effectiveness of different intervention strategies",
      "Evaluate the economic impact of interventions",
      "Advocate for policies and programs prioritizing cost-effective interventions",
      "Assess resources available to support interventions with the selected population",
      "Develop customized strategies to maximize resource utilization",
      "Lead interprofessional teams in resource acquisition and management",
      "Collaborate with decision-makers to allocate resources effectively",
      "Develop strategic relationships with policymakers, community leaders, healthcare providers, and other stakeholders",
      "Use data to support arguments for identified interventions",
      "Propose data informed interventions to policymakers, stakeholders, and community leaders",
      "Apply relevant ethical principles to resource allocation decisions",
      "Evaluate the ethical implications of different resource allocation strategies",
      "Justify resource allocation decisions",
      "Lead initiatives to address equitable resource allocation",
      "Evaluate the impact of resource allocation decisions on health equity",
      "Identify key components of health policy",
      "Outline the process for drafting, reviewing, and finalizing a policy document",
      "Identify examples of health policies influencing health outcomes, social justice, and health equity",
      "Use population outcome data to analyze the effectiveness of policies",
      "Explain the role of evidence-based practice in shaping policy",
      "Identify sources of health data to support policy development",
      "Choose relevant evidence to support policy development",
      "Identify potential policy improvements to support desired population health outcomes",
      "Advocate for policy modifications using data-driven arguments",
      "Identify basic concepts of globalization and their relevance to health",
      "Evaluate the effectiveness of international health initiatives in addressing global health issues",
      "Describe key policy areas where nurses can have an impact",
      "Analyze healthcare trends and challenges to identify gaps or needs that could be addressed through policy",
      "Identify barriers and facilitators to achieve positive outcomes through policy change",
      "Develop clear advocacy goals and objectives for specific policy outcomes",
      "Choose appropriate advocacy strategies to achieve goals and objectives",
      "Implement advocacy strategies with measurable action steps",
      "Demonstrate leadership by initiating advocacy-related activities",
      "Identify opportunities for improving policy",
      "Demonstrate engagement in policy work by participating in initiatives at the system, local, state, or national level",
      "Monitor policy outcomes and their impact on health care delivery, patient outcomes, and professional practice",
      "Analyze feedback and data to assess the effectiveness of the policy and recommend improvements if needed",
      "Assess policy effectiveness in reducing disparities and inequities",
      "Interpret data to determine whether the policy effectively reduces inequities or perpetuates existing disparities",
      "Analyze global health data to identify trends in population health risks associated with globalization",
      "Evaluate global policies and interventions for their cultural appropriateness and responsiveness to diverse populations",
      "Describe common health disparities and unmet needs in different populations",
      "Develop evidence-based arguments for population health changes using data and evidence",
      "Identify key drivers of a change proposal",
      "Develop a compelling description of the proposed change using data and evidence",
      "Define stakeholders and their roles in health advocacy initiatives",
      "Determine the stakeholders that would be influential in achieving a proposed change",
      "Identify communication methods used to engage stakeholders",
      "Develop messaging strategies for selected stakeholders",
      "Align the method of communication with the context",
      "Refine and deliver persuasive messages to stakeholders aligning with their priorities and goals",
      "Describe the key metrics and indicators used to evaluate advocacy efforts",
      "Develop evaluation plans for advocacy initiatives",
      "Analyze outcomes of advocacy actions",
      "Use evidence to evaluate specific advocacy priorities",
      "Modify advocacy priorities based on their potential impact on patient care, outcomes, and systems",
      "Identify and engage with relevant stakeholders to gather diverse perspectives and expertise",
      "Describe potential advocacy approaches",
      "Develop a collaborative advocacy plan by integrating input from multiple stakeholders and disciplines",
      "Develop and implement strategies for sustaining long-term, mutually beneficial relationships with stakeholders",
      "Evaluate and refine strategies for engaging stakeholders, fostering collaboration, and addressing potential barriers to relationship-building",
      "Identify leadership approaches to promote advocacy initiatives using principles of cultural humility, inclusivity, social justice, and diversity",
      "Evaluate the effectiveness of leadership skills used to promote advocacy initiatives",
      "Describe potential disasters or public health emergencies",
      "Describe conditions indicating an impending disaster or public health emergency",
      "Analyze data and trends to identify early warning signs of disasters or public health emergencies",
      "Discuss protocols for early detection and response to disasters or public health emergencies",
      "Describe foundational concepts of climate change and its potential impact on human health",
      "Identify vulnerable populations at increased risk due to climate change",
      "Explain the link between climate factors and the spread of infectious diseases",
      "Explain the complex relationship between climate change, environmental factors, and human health",
      "Assess health risks for specific populations and communities impacted by climate change",
      "List common health hazards associated with different types of disasters",
      "Identify potential psychological and social impacts of disasters on individuals and communities",
      "Describe basic principles of emergency preparedness and response",
      "Assess the potential impact of various disasters on healthcare systems and community infrastructure",
      "Describe disasters' psychological and social consequences and their impact on recovery efforts",
      "Explain the importance of following safety protocols during disasters and emergencies",
      "Identify components of appropriate PPE for different situations",
      "Describe principles of decontamination and infection control in emergency settings",
      "Demonstrate hand hygiene and other infection control techniques",
      "Don and doff PPE for standard precautions",
      "Participate in simulated disaster drills incorporating basic infection control measures",
      "Implement infection control measures in various clinical and emergency settings",
      "Demonstrate proficiency in using PPE for various types of isolation",
      "Identify potential roles and responsibilities in emergency response plans",
      "Develop strategies to lead rapid response teams during public health emergencies",
      "Assess and address urgent public health needs in emergency situations",
      "Describe the importance of addressing health disparities and social determinants of health in emergency preparedness planning",
      "Identify vulnerable populations at increased risk during emergencies and advocate for their needs",
      "Participate in discussions about ethical considerations related to resource allocation and triage during disasters",
      "Advocate for equitable access to healthcare resources and services for all populations during emergencies",
      "Make ethical decisions regarding resource allocation and triage, prioritizing the needs of the most vulnerable",
      "Integrate social justice and health equity principles into various emergency preparedness and response aspects",
      "Contribute to the development of interdisciplinary emergency preparedness plans for specific populations or communities",
      "Participate in interdisciplinary community outreach and education efforts to increase awareness of disaster preparedness",
      "Develop interdisciplinary community-based programs to improve disaster preparedness and resilience",
      "Engage in interdisciplinary collaboration with community organizations on issues related to disaster preparedness",
      "Reinforce evidence-based infection control measures by supporting proper PPE use, assisting with protocol implementation, or educating peers, as appropriate, in collaboration with interdisciplinary teams",
      "Identify resources for securing appropriate PPE",
      "Develop comprehensive infection control protocols for emergency settings",
      "Evaluate infection control practices to identify areas for improvement",
      "Evaluate emergency response activities and identify areas for improvement",
      "Propose evidence-based system-level improvements to emergency preparedness and response plans"
    ],
    "source_file": "Domain-3-Progression-Indicators-Both.pdf"
  },
  {
    "domain_name": "Domain 7: Systems -Based Practice",
    "progression_indicators": [
      "Apply knowledge of systems to work effectively across the continuum of care.",
      "Explain the organizational structure and key leadership roles within a healthcare setting.",
      "Articulate the relationship between an organization’s structure, mission, vision, philosophy, and values, emphasizing their influence on patient care and nursing practice.",
      "Explain how the organizational structure shapes clinical decision-making and interdisciplinary collaboration.",
      "Differentiate among macrosystems, mesosystems, and microsystems within healthcare organizations.",
      "Analyze the interactions between these systems to explain their influence on patient care delivery and outcomes.",
      "Identify key characteristics of different healthcare environments across the continuum of care.",
      "Define the nurse’s role in ensuring continuity of care during patient transitions.",
      "Analyze how transitions between healthcare settings impact patient outcomes and nursing responsibilities.",
      "Identify internal processes and external factors influencing care coordination and patient transitions.",
      "Evaluate the effectiveness of internal processes in facilitating care coordination and patient transitions.",
      "Propose strategies to address barriers to effective care transitions.",
      "Describe the elements of organizational SWOT (strengths, weaknesses, opportunities, and threats) analysis.",
      "Analyze data and trends relevant to strategic goals within a healthcare organization and summarize findings, linking them to potential strategic initiatives.",
      "Develop and present a strategic plan proposal based on a SWOT analysis, addressing a specific organizational priority using evidence-based practices.",
      "Evaluate the alignment between a healthcare organization’s strategic goals and its mission, vision, and values while identifying opportunities for improvement.",
      "Collaborate with interdisciplinary team members to develop evidence-based strategies to achieve organizational goals.",
      "Collaborate with an interdisciplinary team to identify barriers and propose evidence-based solutions for system improvements.",
      "Contribute to designing or evaluating system-wide initiatives to improve care delivery or patient outcomes.",
      "Assess the impact of system-wide initiatives on patient outcomes and organizational performance.",
      "Communicate the outcomes of system-wide initiatives to stakeholders, emphasizing their impact on care quality.",
      "Integrate evidence-based practices into system-wide initiatives to ensure alignment with organizational goals and standards of care.",
      "Utilize data analytics to assess the effectiveness of system-wide processes in patient care and organizational performance.",
      "Propose evidence-based strategies to enhance the efficiency and effectiveness of system-wide processes.",
      "Conduct a comprehensive analysis of a system-wide process to identify gaps and recommend optimization strategies.",
      "Evaluate the impact of implemented changes on system-wide processes, patient outcomes, and organizational performance.",
      "Collaborate with interdisciplinary team members to implement improved system-wide processes, ensuring alignment with evidence-based practices and optimizing outcomes.",
      "Analyze institutional, state, and federal policies for their impact on health equity.",
      "Develop policy proposals aimed at eliminating structural barriers and improving equitable healthcare delivery.",
      "Present policy proposals to stakeholders to advocate for systemic change.",
      "Engage in policymaking at the organizational or governmental level to promote health equity and social justice in healthcare.",
      "Identify key financial concepts in healthcare.",
      "Describe basic insurance coverage principles and their role in patient access to care.",
      "Explain how different payment models shape care delivery.",
      "Identify how social determinants of health contribute to disparities in patient outcomes.",
      "Describe the relationships between social and environmental factors and their influence on health status among populations.",
      "Articulate patients’ unique circumstances, demonstrating sensitivity to how social determinants affect health and access to care.",
      "Integrate knowledge of health disparities into patient assessments and care planning.",
      "Describe basic payment models and their influence on healthcare access and quality.",
      "Identify how cost considerations affect care delivery and patient outcomes.",
      "Analyze how payment models influence nursing practice, patient outcomes, and healthcare access.",
      "Identify fundamental healthcare policies and regulations that influence nursing practice and patient care.",
      "Articulate how economic factors interact with policies to shape patient access and health outcomes.",
      "Describe examples of how regulatory requirements affect care delivery processes within clinical settings.",
      "Describe the intersection of policy, regulation, and economics, evaluating their impact on resource allocation, patient care quality, safety, and outcomes.",
      "Describe the importance of efficiency, resource utilization, and value in patient care while identifying cost-saving strategies that maintain quality outcomes.",
      "Explore how evidence-based practices contribute to high-value care by optimizing resource use and improving efficiency.",
      "Assess the impact of cost and efficiency in nursing care delivery and provide alternatives during care planning.",
      "Identify workforce needs within clinical settings and their impact on care coordination and patient outcomes.",
      "Analyze how leadership styles and team dynamics influence safe, effective care delivery.",
      "Explain how system-level structures affect the quality and consistency of patient care.",
      "Examine key internal factors that impact healthcare costs.",
      "Identify external cost drivers and explain how they influence healthcare costs and reimbursement.",
      "Examine the interplay between cost drivers and reimbursement models.",
      "Synthesize data from organizational reports or policy analyses to assess the influence of internal and external factors on financial outcomes and healthcare quality.",
      "Apply knowledge of cost drivers to advocate for strategies that improve efficiency and reimbursement rates while maintaining quality healthcare.",
      "Explore evidence-based practices that improve healthcare quality and patient outcomes while addressing cost considerations.",
      "Identify barriers to access and equity within healthcare systems and consider potential solutions.",
      "Propose strategies to enhance value and cost-effectiveness.",
      "Adopt care models, workflows, or processes that prioritize value, quality, and efficiency through evidence-based approaches.",
      "Prioritize interventions supported by research and best practices.",
      "Evaluate, redesign, and refine practices to improve cost-effectiveness and care quality.",
      "Identify key healthcare policies and regulations that impact cost, quality, and value in healthcare delivery.",
      "Explore advocacy strategies and participate in discussions regarding economic policy changes.",
      "Advocate for policy changes that align with evidence-based practices and improve cost-effectiveness and value in care delivery.",
      "Engage with organizations and healthcare professionals to support policies that enhance quality and equity.",
      "Evaluate proposals addressing economic challenges within healthcare delivery systems.",
      "Explore methods for calculating return on investment (ROI) using fundamental tools and metrics in quality improvement projects.",
      "Contribute to discussions regarding ROI and value-based care initiatives.",
      "Draft initial reports documenting outcomes and cost savings from small-scale improvement projects.",
      "Collaborate with interdisciplinary team members to formulate comprehensive ROI analyses for improvement initiatives by integrating financial and clinical outcomes.",
      "Prepare reports and present findings on ROI, utilizing evidence to advocate for continued investment in high-value initiatives.",
      "Analyze organizational structures and workforce challenges to identify opportunities for enhancing cost-effectiveness.",
      "Explore leadership strategies that support financial efficiency while maintaining quality standards.",
      "Participate in team discussions on system-level changes to optimize resource utilization and reduce costs.",
      "Recommend strategies that address workforce needs and improve cost-effectiveness across healthcare systems.",
      "Develop proposals for system-wide changes that incorporate evidence-based practices and workforce data.",
      "Collaborate with interdisciplinary teams to implement initiatives that align with financial and quality improvement goals.",
      "Review health policies through an ethical lens, focusing on their impact on cost-effectiveness and patient care.",
      "Participate in discussions on health equity, analyzing how policies address disparities in access and outcomes.",
      "Evaluate health policies for alignment with ethical principles, cost-effectiveness, and equity in care delivery.",
      "Develop policy recommendations that address gaps in health equity and improve patient outcomes.",
      "Collaborate with stakeholders to advocate for ethically sound policies that optimize care delivery.",
      "Collect appropriate patient-specific information from health information systems to inform clinical decision-making.",
      "Articulate pertinent patient information and align it with evidence-based practices to justify clinical decisions.",
      "Apply patient-specific information from health information systems to guide clinical decision-making in practice.",
      "Utilize structured tools or frameworks to support clinical reasoning and ensure evidence-based practice.",
      "Identify standard healthcare quality metrics.",
      "Demonstrate the ability to locate and interpret outcome data.",
      "Evaluate the effectiveness of nursing care interventions using specific quality metrics.",
      "Incorporate quality metrics into plans of care to monitor trends and compare outcomes over time.",
      "Identify areas of system performance that impact patient care outcomes based on evidence-based practice guidelines.",
      "Propose preliminary ideas for addressing identified gaps using evidence-based practices.",
      "Use evidence-informed practice guidelines to assess system-level impact on patient outcomes and care processes.",
      "Analyze and interpret system-level performance metrics at the unit level to assess effectiveness of evidence-based interventions.",
      "Identify examples of structural or systemic racism and discrimination in healthcare settings.",
      "Reflect on and discuss personal experiences or observed practices in clinical settings that contribute to inequities in healthcare delivery.",
      "Identify actionable, evidence-informed recommendations to address systemic inequities in healthcare.",
      "Conduct a needs assessment to identify gaps in system preparedness and capabilities.",
      "Review and critique current organizational policies or protocols on emergency preparedness and system resilience using evidence-based frameworks.",
      "Propose initial strategies for improving system capabilities based on evidence from recent literature or guidelines.",
      "Design innovative, evidence-based strategies to enhance system preparedness and capabilities in response to complex healthcare challenges.",
      "Integrate interdisciplinary perspectives to develop robust preparedness plans.",
      "Evaluate the effectiveness of preparedness interventions by analyzing outcome metrics and providing actionable feedback for improvement.",
      "Access and interpret organizational performance metrics.",
      "Analyze trends in performance data to identify opportunities for improvement.",
      "Develop and present a plan for system improvements using organizational performance data and evidence-based methodologies.",
      "Utilize performance metrics to monitor the effectiveness of implemented strategies and modify interventions as needed.",
      "Identify internal and external factors that influence the success of change initiatives.",
      "Collaborate with stakeholders to foster support for change initiatives and enhance system effectiveness using evidence-based strategies.",
      "Utilize change management frameworks to design interventions that enhance clinical practice.",
      "Develop a comprehensive change management strategy to address system issues, ensuring alignment with organizational goals and evidence-based practices.",
      "Implement evaluation processes to monitor the impact of change initiatives on system effectiveness using performance data and metrics.",
      "Develop strategies to sustain successful changes and ensure long-term effectiveness.",
      "Analyze performance metrics, health outcomes data, and organizational policies to identify areas where systemic inequities, structural racism, or discrimination exist.",
      "Appraise literature on interventions designed to reduce disparities and discrimination within healthcare systems.",
      "Address identified inequities by incorporating evidence, stakeholder perspectives, and feedback to refine improvement strategies.",
      "Develop a system improvement plan targeting processes and structures that perpetuate inequities in healthcare.",
      "Evaluate the outcomes of implemented strategies using performance metrics and patient outcome data.",
      "Promote a culture of continuous improvement by identifying areas for further intervention and sustaining successful initiatives through system-wide policies."
    ],
    "source_file": "Domain-7-Progression-Indicators-Both.pdf"
  },
  {
    "domain_name": "Domain 10: Personal, Professional, and Leadership Development",
    "progression_indicators": [
      "Demonstrate a commitment to personal health and well-being.",
      "Identify self-care practices that support personal wellness.",
      "Review personal health data and identify patterns, then modify self-care routines accordingly.",
      "Assess how ongoing self-care habits are related to measures of well-being.",
      "Identify instances where personal and professional demands conflict.",
      "Identify strategies to mitigate the impact of conflict on personal well-being.",
      "Analyze recurring patterns of role conflict and apply responsive coping methods.",
      "Analyze the key elements of a supportive environment for self-care and well-being.",
      "Evaluate how supportive environments, well-being, and self-care impact patients and colleagues in clinical or academic settings.",
      "Collect baseline data on staff well-being through assessment methods.",
      "Recommend targeted strategies to enhance a healthy work environment.",
      "Demonstrate a spirit of inquiry that fosters flexibility and professional maturity.",
      "Identify reflection strategies to evaluate practice.",
      "Participate in guided reflection for practice improvement.",
      "Analyze personal clinical experiences through both structured and spontaneous reflection.",
      "Integrate insights from reflection to improve professional practice.",
      "Identify primary feedback sources and describe their role in skill development.",
      "Evaluate performance changes resulting from integrated feedback.",
      "Identify personal and professional development resources and opportunities.",
      "Engage in personal and professional development activities.",
      "Explore key learning resources for clinical knowledge enhancement.",
      "Assess personal knowledge gaps and seek growth opportunities.",
      "Examine how integrated knowledge influences decision-making.",
      "Apply new knowledge and experiences to enhance clinical judgment.",
      "Describe the essential traits of a supportive role model and their importance in professional development.",
      "Evaluate strategies for maintaining and expanding mentorship networks.",
      "Identify the principles of diversity, equity, inclusion, and anti-discrimination.",
      "Participate in activities that incorporate diversity, equity, inclusion, and anti-discrimination principles.",
      "Reflect on how involvement in these experiences may impact your professional nursing practice.",
      "Evaluate new information as it becomes available.",
      "Integrate constructive feedback to enhance decision-making.",
      "Synthesize complex data from multiple sources to adjust priorities and interventions dynamically.",
      "Anticipate potential changes and proactively develop contingency plans in complex care situations.",
      "Model professionalism by demonstrating appropriate behavior.",
      "Engage attentively with peers, providing feedback and responding thoughtfully to their questions and concerns.",
      "Reinforce positive actions or attitudes exhibited by peers during clinical learning experiences.",
      "Mentor others by providing specific, actionable, and constructive feedback to peers or junior team members to enhance their clinical skills or professional behavior.",
      "Guide others in reflecting on their practice to identify strengths and areas for improvement.",
      "Foster a nonjudgmental, supportive atmosphere that encourages learning and collaboration.",
      "Seek new knowledge and skills through assigned readings, discussions, and professional engagement.",
      "Share helpful articles, tools, or insights to support group learning and professional development.",
      "Set personal learning goals and work independently to achieve them while encouraging peers to do the same.",
      "Demonstrate commitment to lifelong learning by staying current with evidence-based practices and sharing updates with peers or teams.",
      "Organize or lead workshops, journal clubs, or study groups to enhance peer learning and professional growth.",
      "Establish and share long-term professional learning goals aligned with nursing practice.",
      "Join a professional nursing organization or attend an event such as a meeting or conference.",
      "Volunteer for community or public health projects, nursing events, or organizational initiatives.",
      "Plan and execute an event that benefits the nursing profession.",
      "Participate in or lead discussions about healthcare policy, education, or practice standards in professional service settings.",
      "Compare and contrast leadership principles and theories.",
      "Identify key leadership theories and their characteristics.",
      "Articulate relevant principles of leadership considerations.",
      "Explain foundational leadership theories and their relevance to nursing practice.",
      "Compare the core concepts, strengths, and limitations of multiple leadership theories.",
      "Describe a personal leadership style based on values and experiences.",
      "Identify elements of leadership that align with personal values and experiences.",
      "Develop a leadership philosophy integrating leadership theories, personal strengths, and professional goals.",
      "Manage and understand others' emotions to foster strong interpersonal relationships and cohesive teams.",
      "Seek feedback from instructors or peers on leadership behaviors.",
      "Identify leadership behaviors in others and follow a leader’s direction.",
      "Delegate tasks, coordinate team efforts, and monitor progress toward goals effectively.",
      "Provide and receive feedback professionally and constructively.",
      "Take responsibility for leadership actions and team decision outcomes.",
      "Identify areas for growth and seek opportunities to build confidence in leadership roles.",
      "Seek assistance and feedback to develop leadership competencies.",
      "Address challenges and make independent decisions using critical thinking and clinical judgment.",
      "Advocate for oneself professionally by seeking opportunities, resources, or support.",
      "Identify evidence-based resources to navigate uncertain situations.",
      "Ask for guidance when there is uncertainty about patient care or treatment decisions, recognizing their limitations in managing the ambiguity.",
      "Acknowledge uncertainty in professional situations and communicate uncertainty to gain support.",
      "Analyze relevant data to support decision-making in ambiguous situations.",
      "Collaborate with colleagues to gain diverse perspectives in uncertain clinical settings.",
      "Utilize clinical decision support systems and technology for complex decision-making.",
      "Recognize areas for leadership improvement and demonstrate openness to change.",
      "Reflect on leadership experiences to identify strengths and weaknesses.",
      "Identify specific leadership strengths and weaknesses through self-reflection and focus on improving these areas.",
      "Modify leadership behaviors based on guided self-reflection.",
      "Establish and work toward leadership development goals based on feedback.",
      "Identify and acknowledge personal implicit biases and their impact on patient care.",
      "Describe the relationship between personal culture and implicit biases.",
      "Identify and mitigate biases on an ongoing basis.",
      "Discuss implicit bias with colleagues and mentors to develop strategies for mitigation.",
      "Engage in self-reflection to critically assess how biases influence interactions.",
      "Model professionalism in appearance and communication.",
      "Demonstrate confidence, professionalism, and accountability in verbal and nonverbal communication, setting a positive example and guiding patients, families, and healthcare team members with clarity and assurance.",
      "Explain the nurse’s role in contributing to healthcare policy issues that impact nursing practice and patient care.",
      "Advocate for policies that support professional nursing practice, e.g., safe staffing, equitable care access, and professional nursing advancement.",
      "Join and participate in a professional nursing organization.",
      "Assume leadership or committee membership within professional service.",
      "Apply leadership principles to motivate teams and foster a shared vision.",
      "Evaluate leadership strategies used in practice change and refine approaches based on evidence.",
      "Collect data regarding the impact of new policies or initiatives.",
      "Assess the impact of new policies or initiatives based on data analysis.",
      "Compare different peer review models and identify best practices.",
      "Develop and implement a peer review process to foster professional growth and accountability.",
      "Provide constructive feedback to colleagues through formal peer review processes.",
      "Facilitate interprofessional evaluations to ensure comprehensive performance assessments.",
      "Adapt leadership strategies to address unexpected organizational challenges.",
      "Participate in crisis management planning and execution, demonstrating decisiveness and resilience.",
      "Identify systemic inequities in healthcare and engage in reflective dialogue with colleagues.",
      "Develop initiatives addressing health disparities and collaborate with community partners for equitable healthcare solutions.",
      "Mentor new nurses, fostering their professional growth and engagement in advocacy.",
      "Represent nursing in public forums, articulating the profession’s contributions and advocating for policy changes that support health equity and community well-being."
    ],
    "source_file": "Domain-10-Progression-Indicators-Both.pdf"
  },
  {
    "domain_name": "Domain 8: Informatics and Healthcare Technologies",
    "progression_indicators": [
      "Describe the various information and communication technology tools used in the care of patients, communities, and populations.",
      "Identify the variety of information and communication technologies used in care settings.",
      "Recognize commonly used information and communication technologies in clinical settings.",
      "Explain the fundamental purpose of each identified technology.",
      "Describe the primary information and communication tools used in patient care.",
      "Compare the features and benefits of different information and communication technology (ICT) options for specific care tasks.",
      "Identify the basic concepts of electronic health, mobile health, and telehealth systems for enabling patient care.",
      "Describe the fundamental features of electronic health, mobile health, and telehealth systems.",
      "Explain how electronic health, mobile health, and telehealth systems support patient care.",
      "Demonstrate appropriate use of electronic health, mobile health, or telehealth systems in patient care.",
      "Compare and contrast the benefits and limitations of various electronic health, mobile health, and telehealth solutions in clinical contexts.",
      "Effectively use electronic communication tools.",
      "Identify electronic communication tools utilized in clinical interactions.",
      "Demonstrate fundamental use of electronic communication tools during patient care.",
      "Demonstrate fluent use of electronic communication methods.",
      "Apply appropriate electronic communication tools in diverse healthcare settings when interacting with patients and interdisciplinary team members.",
      "Describe the appropriate use of multimedia applications in health care.",
      "Identify commonly used multimedia applications in patient education.",
      "Articulate how multimedia applications enhance patient engagement and learning.",
      "Assess the effectiveness of different multimedia tools for specific patient populations.",
      "Demonstrate best practice use of social networking applications.",
      "Articulate professional guidelines governing the use of social media in healthcare.",
      "Analyze the ethical implications of social media use in patient-centered care.",
      "Demonstrate appropriate and professional use of social media in diverse healthcare settings.",
      "Explain the importance of nursing engagement in the planning and selection of healthcare technologies.",
      "Identify processes involved in the selection of healthcare technologies.",
      "Explain the necessity of nurse input in selecting patient care technologies.",
      "Analyze the impact of nursing engagement on the successful selection and implementation of healthcare technologies.",
      "Recommend specific criteria and characteristics for healthcare technology based on different care settings and patient populations.",
      "Identify best evidence and practices for the application of information and communication technologies to support care.",
      "Appraise best-practice guidelines for the use of ICT in healthcare settings.",
      "Select and apply evidence to improve ICT best practices in diverse clinical environments.",
      "Evaluate the unintended consequences of information and communication technologies on care processes, communications, and information flow across care settings.",
      "Identify and summarize potential unintended consequences of ICT on patient care outcomes.",
      "Describe the potential impact of information and communication technologies on clinical decision-making and workflow efficiency.",
      "Assess ICT-related challenges and propose evidence-based solutions.",
      "Address ICT challenges when planning and evaluating patient care strategies.",
      "Propose a plan to influence the selection and implementation of new information and communication technologies.",
      "Summarize key organizational considerations for selecting new ICT solutions.",
      "Demonstrate initial planning steps for introducing a new ICT solution into a clinical environment.",
      "Collaboratively develop a comprehensive implementation strategy for an ICT innovation.",
      "Explore the fiscal impact of information and communication technologies on health care.",
      "Identify essential cost factors associated with ICT implementation.",
      "Analyze the cost-effectiveness of various ICT solutions in different clinical settings.",
      "Identify the impact of information and communication technologies on workflow processes and healthcare outcomes.",
      "Describe how ICT influences clinical workflow efficiency.",
      "Recognize ICT-driven patient care outcomes and their influence on clinical decision-making.",
      "Analyze the relationship between ICT integration and changes in healthcare delivery processes.",
      "Modify patient care plans based on the evaluation of ICT impact and healthcare outcomes.",
      "Use information and communication technology to gather data, create information, and generate knowledge.",
      "Enter accurate data when chronicling care.",
      "Identify essential documentation guidelines for accurate data entry.",
      "Enter and verify comprehensive patient information for accuracy.",
      "Explain how data entered on one patient impacts public and population health data.",
      "Describe how individual patient records contribute to public and population health statistics.",
      "Analyze the impact of individual patient documentation on population-level trends.",
      "Compare individual patient data for specific diagnoses with local and regional population data.",
      "Use appropriate data when planning care.",
      "Identify relevant clinical data required for effective care planning.",
      "Incorporate relevant data and trends in plans of care.",
      "Demonstrate the appropriate use of health information literacy assessments and improvement strategies.",
      "Explain key strategies for enhancing a patient’s health information literacy.",
      "Recommend strategies to improve health information literacy among diverse populations.",
      "Describe the importance of standardized nursing data to reflect the unique contribution of nursing practice.",
      "Explain how standardized nursing data ensures that patient care assessments, interventions, and outcomes are measurable.",
      "Examine the role of standardized documentation in enhancing the visibility and quantifiability of nursing contributions.",
      "Generate information and knowledge from health information technology databases.",
      "Retrieve and organize relevant clinical data from health information technology (HIT) databases.",
      "Analyze multifaceted data across HIT databases to identify patterns or correlations that inform clinical decision-making.",
      "Evaluate the use of communication technology to improve consumer health information literacy.",
      "Assess whether health information provided through technology aligns with health literacy best practices.",
      "Identify potential barriers to technology adoption.",
      "Synthesize information and communication technology to enhance data flow, interoperability, and scalability for population-level interventions.",
      "Propose information and communication technology interventions based on the synthesis of literacy improvement, engagement rates, and health outcomes.",
      "Use standardized data to evaluate decision-making and outcomes across all systems levels.",
      "Analyze data to identify trends in patient outcomes.",
      "Analyze data to identify areas for operational improvements.",
      "Examine epidemiological data to recommend evidence-based public health interventions.",
      "Use standardized datasets to justify clinical reasoning.",
      "Utilize standardized data to recognize patterns and opportunities for quality improvement.",
      "Clarify how the collection of standardized data advances the practice, understanding, and value of nursing and supports care.",
      "Provide examples of how standardized data enhances patient safety, efficacy, and satisfaction.",
      "Articulate pathways from data collection to improved health outcomes.",
      "Justify the use of standardized data collection to support evidence-based care planning.",
      "Communicate the impact of standardized data analysis to interprofessional team members during decision-making processes.",
      "Interpret primary and secondary data and other information to support care.",
      "Differentiate between primary and secondary data sources.",
      "Analyze primary and secondary datasets to identify care requirements and inform decision-making.",
      "Synthesize primary and secondary data to understand patient and population health needs comprehensively.",
      "Recognize the limitations of available data and its implications for care planning.",
      "Use information and communication technologies and informatics processes to deliver safe nursing care to diverse populations in a variety of settings.",
      "Demonstrate appropriate use of information and communication technologies.",
      "Identify examples of adherence to HIPAA and other privacy standards when utilizing information and communication technologies.",
      "Recognize how cultural, linguistic, and health literacy differences influence the selection and use of communication technologies.",
      "Apply appropriate technologies for delivering nursing care in various settings.",
      "Integrate clinical decision support tools to enhance care quality and safety.",
      "Evaluate how decision support tools impact clinical judgment and safe patient care.",
      "Explain the ethical implications of over-reliance on decision-support tools and their effect on critical thinking and clinical judgment.",
      "Identify the strengths and limitations of decision-support tools in clinical practice.",
      "Analyze the correlation between decision-support tools and observable patient outcomes.",
      "Integrate decision-support tools with clinical observations and patient preferences to facilitate holistic care decisions.",
      "Use information and communication technology in a manner that supports the nurse-patient relationship.",
      "Provide examples of adherence to HIPAA and other privacy standards when engaging in electronic communication.",
      "Consider cultural, linguistic, and health literacy differences when selecting and using communication technologies.",
      "Employ digital tools to communicate with patients regarding their health conditions, treatment plans, and self-care strategies.",
      "Examine how emerging technologies influence healthcare delivery and clinical decision making.",
      "Participate in training on emerging healthcare technologies.",
      "Engage in discussions regarding the ethical and practical implications of healthcare technology.",
      "Analyze the successes and challenges associated with integrating technology into care delivery.",
      "Articulate the perspectives of healthcare teams on incorporating technological devices and platforms into clinical practice.",
      "Identify impact of information and communication technology on quality and safety of care.",
      "Identify patient safety and care quality metrics influenced by technology use.",
      "Recognize systems that monitor and track patient safety and care quality metrics.",
      "Analyze ICT data to identify trends and outcomes related to patient safety and care quality.",
      "Use findings from ICT data to inform clinical decision-making to enhance care quality.",
      "Identify the importance of reporting system processes and functional issues (error messages, mis-directions, device malfunctions, etc.) according to organizational policies and procedures.",
      "Explain organizational policies and procedures for reporting system issues.",
      "Explain the relationship between system reporting processes and patient safety.",
      "Demonstrate appropriate documentation and reporting of system issues according to institutional policies.",
      "Evaluate the use of information and communication technology to address needs, gaps, and inefficiencies in care.",
      "Define the role of ICT in improving care access, utilization, and delivery.",
      "Identify opportunities for improving the patient-technology interface.",
      "Assess current technology use in healthcare settings to enhance care efficiency and facilitate patient access.",
      "Propose strategies to optimize the use of ICT in healthcare service delivery.",
      "Formulate a plan to influence decision-making processes for selecting, implementing, and evaluating support tools.",
      "Assess the needs and goals of stakeholders when selecting healthcare technologies.",
      "Conduct a needs assessment to identify gaps in existing processes and technology.",
      "Analyze available tools and resources.",
      "Develop a strategic plan aligning stakeholder needs, organizational goals, and available resources.",
      "Advocate for change and communicate implementation plans to decision-makers.",
      "Establish a quality improvement monitoring system to evaluate the effectiveness of implemented tools.",
      "Appraise the role of information and communication technologies in engaging the patient and supporting the nurse-patient relationship.",
      "Assess patient preferences, cultural considerations, and access to technology resources.",
      "Determine the effectiveness of various technological tools in improving patient engagement, self-management, and adherence to treatment plans.",
      "Evaluate the quality and frequency of nurse-patient communication facilitated by technology.",
      "Analyze how technology impacts the quality of the nurse-patient relationship.",
      "Evaluate the potential uses and impact of emerging technologies in health care.",
      "Assess the effectiveness of new technologies in improving patient engagement, self-management, and treatment adherence.",
      "Examine the ethical, legal, and social implications of adopting emerging technologies in healthcare.",
      "Identify areas where emerging technologies can enhance healthcare delivery.",
      "Evaluate the feasibility of implementing emerging technologies.",
      "Pose strategies to reduce inequities in digital access to data and information.",
      "Analyze barriers to accessing digital health tools and information.",
      "Implement initiatives targeting populations most affected by digital health inequities.",
      "Design educational programs to improve patient utilization of digital health tools.",
      "Propose strategies to enhance the availability and accessibility of necessary healthcare technology.",
      "Use information and communication technology to support documentation of care and communication among providers, patients, and all system levels.",
      "Explain the role of communication technology in enhancing clinical information flows.",
      "Describe the various communication technologies utilized in healthcare settings.",
      "Articulate the benefits and limitations of information and communication technologies in enhancing communication among healthcare providers and between providers and patients.",
      "Describe how information and communication technology tools support patient and team communications.",
      "Explain the role of information and communication technologies in improving the accuracy and efficiency of information exchange within the healthcare team.",
      "Explain how ICT tools enhance communication efficiency, reduce errors, and improve patient safety.",
      "Identify the basic concepts of electronic health, mobile health, and telehealth systems in enabling patient care.",
      "Describe the core functionalities of the electronic health used in clinical settings.",
      "Differentiate between the applications of electronic health, mobile health (mHealth), and telehealth in patient care, highlighting the benefits and limitations of each.",
      "Explain the impact of health information exchange, interoperability, and integration on health care.",
      "Define health information exchange, interoperability, and integration, and describe their influence on healthcare delivery.",
      "Analyze the impact of health information exchange on patient safety, care coordination, and healthcare efficiency.",
      "Assess best practices for the use of advanced information and communication technologies to support patient and team communications.",
      "Evaluate the effectiveness of various communication technologies used within the healthcare team.",
      "Recommend evidence-based strategies to optimize information and communication technologies for enhancing provider collaboration, patient outcomes, and care coordination.",
      "Employ electronic health, mobile health, and telehealth systems to enable quality, ethical, and efficient patient care.",
      "Utilize telehealth platforms to conduct patient assessments, provide education, and deliver care to remote or underserved populations.",
      "Incorporate technologies to ensure adherence to ethical guidelines, patient safety protocols, and regulatory standards for care delivery.",
      "Evaluate the impact of health information exchange, interoperability, and integration to support patient-centered care.",
      "Analyze the benefits and challenges of implementing a health information exchange within a healthcare organization, considering its impact on patient data access, care coordination, and workflow efficiency.",
      "Evaluate interoperability among EHR systems to enhance patient data sharing and facilitate care transitions across various healthcare settings.",
      "Use information and communication technologies in accordance with ethical, legal, professional, and regulatory standards, and workplace policies in the delivery of care.",
      "Identify common risks associated with using information and communication technology.",
      "Recognize potential breaches in patient confidentiality related to electronic health records.",
      "Explain the importance of adhering to organizational policies regarding password management, data encryption, and secure messaging to protect patient information in compliance with HIPAA regulations.",
      "Demonstrate ethical use of social networking applications.",
      "Identify risks associated with sharing patient information or discussing work-related issues on social media platforms, emphasizing the importance of maintaining professional boundaries and patient privacy.",
      "Apply professional guidelines and institutional policies for responsible social media use to protect patient confidentiality and uphold the integrity of the nursing profession.",
      "Comply with legal and regulatory requirements while using communication and information technologies.",
      "Follow institutional policies for accessing and documenting patient information in EHRs, ensuring compliance with privacy and security protocols.",
      "Explain the legal and ethical implications of electronic patient data sharing, emphasizing HIPAA regulations and obtaining patient consent before disclosing health information.",
      "Educate patients on their rights to access, review, and correct personal data and medical records.",
      "Provide educational materials explaining patients' rights to access, review, and manage their health information.",
      "Assist patients in navigating patient portals to access their health data and answering questions about system functionalities and benefits.",
      "Discuss how clinical judgment and critical thinking must prevail in the presence of information and communication technologies.",
      "Recognize the limitations of information and communication technologies and seek clarification or validation from other sources when necessary.",
      "Explain how clinical judgment and critical thinking are essential for interpreting EHR data, identifying potential errors, and making informed patient care decisions.",
      "Deliver care using remote technology.",
      "Assist in telehealth visits, ensuring proper equipment setup, lighting, and audio while troubleshooting technical issues.",
      "Facilitate telehealth visits effectively by using appropriate communication techniques, utilizing platform features to share educational materials, and documenting encounters accurately in the electronic health record.",
      "Apply risk mitigation and security strategies to reduce misuse of information and communication technology.",
      "Educate healthcare staff on recognizing and reporting phishing attempts and cybersecurity threats that may compromise patient data or organizational systems.",
      "Implement relevant risk mitigation strategies to minimize data breaches and ensure compliance with security regulations.",
      "Assess potential ethical and legal issues associated with the use of information and communication technology.",
      "Identify ethical concerns related to artificial intelligence in healthcare.",
      "Analyze the legal and ethical implications of using patient data for research, ensuring adherence to privacy regulations, data security standards, and institutional review board protocols.",
      "Recommend strategies to protect health information when using communication and information technology.",
      "Suggest improvements to existing security protocols within a clinical setting.",
      "Develop and present best practices for healthcare professionals to uphold patient privacy and confidentiality when utilizing communication and information technology, aligning with legal and ethical standards.",
      "Promote patient engagement with their personal health data.",
      "Facilitate patient engagement with digital health tools.",
      "Incorporate educational resources and workshops to empower patients to navigate and utilize their health data to make informed healthcare decisions.",
      "Advocate for policies and regulations that support the appropriate use of technologies impacting health care.",
      "Research state and federal regulations related to telehealth practices, identifying barriers to equitable access and opportunities for advocacy to enhance healthcare delivery.",
      "Advocate for policies supporting artificial intelligence's ethical and effective integration in healthcare.",
      "Analyze the impact of federal and state policies and regulation on health data and technology in care settings.",
      "Examine the implications of recent state regulations regarding telehealth prescribing practices and their effect on patient access to care, medication safety, and interprofessional collaboration.",
      "Evaluate the impact of current policies on health information exchange and interoperability, considering their potential to improve patient care coordination, reduce costs, and promote innovation in health information technology."
    ],
    "source_file": "Domain-8-Progression-Indicators-Both.pdf"
  },
  {
    "domain_name": "Domain 5: Quality and Safety",
    "progression_indicators": [
      "Apply quality improvement principles in care delivery.",
      "Recognize nursing’s essential role in improving healthcare quality and safety.",
      "Identify key concepts of quality and safety in healthcare.",
      "Describe nurses' responsibility in maintaining healthcare quality and safety.",
      "Explain the nurse's role in preventing patient harm.",
      "Identify nursing-specific quality indicators and safety initiatives to address clinical improvement needs.",
      "Identify nursing-related system-level factors contributing to patient safety issues.",
      "Articulate the importance of the nurse as the last line of defense.",
      "Identify sources and applications of national safety and quality standards to guide nursing practice.",
      "Identify key national safety and quality standards relevant to nursing practice.",
      "Identify key organizations that set national safety and quality standards.",
      "Select national safety and quality standards to analyze clinical situations and guide nursing practice.",
      "Recommend opportunities to improve patient safety based on national safety and quality standards and new evidence.",
      "Implement standardized, evidence-based processes for care delivery.",
      "Identify standardized processes used in nursing practice.",
      "Follow standardized processes for patient care.",
      "Adapt standardized processes to meet the needs of individual patients.",
      "Analyze patient situations/characteristics and act to mitigate patient risks.",
      "Interpret benchmark and unit outcome data to inform individual and microsystem practice.",
      "Identify key trends in unit-level data.",
      "Recognize the relationship between unit-level data and national benchmarks.",
      "Analyze unit- and system-level data to identify areas for improvement in patient care.",
      "Use data to support evidence-based practice decisions.",
      "Compare quality improvement methods in the delivery of patient care.",
      "Describe the basic principles of various quality improvement methods.",
      "Compare the strengths and limitations of quality improvement methods.",
      "Select relevant quality improvement methods to support care improvement.",
      "Identify strategies to improve outcomes of patient care in practice.",
      "Explain the role of patient engagement in improving patient outcomes.",
      "Use communication and collaboration strategies to improve patient outcomes.",
      "Select evidence-based practice strategies to improve patient outcomes.",
      "Recommend protocols essential to improve the outcomes of patient care.",
      "Participate in the implementation of a practice change.",
      "Gather relevant data to support the need for a practice change initiative.",
      "Identify potential barriers to implementing quality improvement initiatives.",
      "Communicate the rationale for the proposed change to colleagues and patients.",
      "Develop quality improvement projects.",
      "Model a practice change and serve as a resource for peers.",
      "Develop a plan for monitoring quality improvement change.",
      "Describe methods for collecting and analyzing data.",
      "Analyze key data to monitor the effectiveness of a practice change.",
      "Develop a monitoring plan.",
      "Justify the selection of a particular quality improvement method to address a clinical issue.",
      "Establish and incorporate data driven benchmarks to monitor system performance.",
      "Determine the specific aspects of system performance that need to be monitored.",
      "Choose methods and frequency of data collection and reporting.",
      "Use data to inform the development and implementation of targeted interventions to improve system performance.",
      "Use national safety resources to lead team-based change initiatives.",
      "Use national safety resources to develop a framework for addressing a patient safety or system performance issue requiring improvement.",
      "Consider relevant stakeholders for the proposed change.",
      "Lead team development, implementation, and evaluation of a comprehensive safety action plan.",
      "Integrate outcome metrics to inform change and policy recommendations.",
      "Choose outcome, process, and efficiency metrics to provide a comprehensive strategy to assess change.",
      "Use outcome data to propose policy recommendations.",
      "Present findings to decision-makers to advocate for policy change.",
      "Conduct a thorough evaluation of practice change to determine effectiveness.",
      "Collaborate in analyzing organizational process improvement initiatives.",
      "Analyze data for a process improvement initiative.",
      "Identify patterns and trends in data relevant to improvement initiatives.",
      "Contribute relevant information and insights based on knowledge, experience, and evidence.",
      "Collaborate in establishing a plan for monitoring and evaluating outcomes of process improvement initiatives.",
      "Lead the development of a business plan for quality improvement initiatives.",
      "Define the scope and objectives of the quality improvement plan.",
      "Lead collection of relevant data to inform the improvement initiative.",
      "Lead prioritized intervention and evaluation strategies for the quality improvement initiative.",
      "Advocate for change related to financial policies that impact the relationship between economics and quality care delivery.",
      "Analyze the impact of financial decisions and policy on quality care delivery and patient outcomes.",
      "Propose cost-effective initiatives to improve quality care delivery.",
      "Use data and evidence-based strategies to advocate for financial policy changes to improve quality care delivery.",
      "Advance quality improvement practices through dissemination of outcomes.",
      "Construct relevant dissemination strategies for outcome dissemination.",
      "Disseminate quality improvement process outcomes.",
      "Contribute to a culture of patient safety.",
      "Describe the factors that create a culture of safety.",
      "Identify key factors contributing to a culture of safety.",
      "Explain how these factors influence patient outcomes.",
      "Identify systemic barriers to a culture of safety.",
      "Propose strategies to foster a culture of safety.",
      "Articulate the nurse’s role within an interprofessional team in promoting safety and preventing errors and near misses.",
      "Identify the nurse’s role in developing and implementing a safety plan in an interprofessional team setting.",
      "Listen to and incorporate input from other team members regarding safety protocols.",
      "Communicate the nurse's role effectively and respectfully within interprofessional teams regarding patient safety concerns.",
      "Communicate patient safety concerns to other interprofessional team members.",
      "Examine basic safety design principles to reduce risk of harm.",
      "Identify basic safety design principles within clinical settings to reduce errors.",
      "Articulate how standardized procedures and checklists contribute to patient safety.",
      "Analyze outcome data to determine the effectiveness of safety design principles.",
      "Assume accountability for reporting unsafe conditions, near misses, and errors to reduce harm.",
      "Identify potential and actual errors and safety concerns related to patient care.",
      "Articulate the steps for reporting potential or actual errors through authorized channels.",
      "Report observed or suspected patient safety concerns using appropriate channels.",
      "Accept feedback constructively and reflect on its role in patient safety.",
      "Describe processes used in understanding causes of error.",
      "Compare the processes used to analyze the contributing factors for errors.",
      "Participate in discussions about the root causes of patient safety events.",
      "Analyze root causes of patient safety incidents and identify potential contributing factors.",
      "Use national patient safety resources, initiatives, and regulations at the point of care.",
      "Reference relevant national patient safety guidelines and resources in clinical discussions.",
      "Apply knowledge of patient safety regulations to clinical practice.",
      "Utilize current evidence-based patient safety guidelines and regulations.",
      "Integrate national patient safety resources into daily clinical practice.",
      "Evaluate the alignment of system data and comparative patient safety benchmarks.",
      "Collect and analyze relevant patient safety data from multiple sources.",
      "Compare local patient safety data to national and international benchmarks.",
      "Analyze areas of significant variation and identify opportunities for improvement.",
      "Propose evidence-based system-level solutions to address opportunities for improvement.",
      "Lead analysis of actual errors, near misses, and potential situations that would impact safety.",
      "Use root cause analyses of complex patient safety events.",
      "Facilitate discussions and identify system-level factors contributing to safety incidents.",
      "Develop and implement strategies for data collection and analysis of near misses and potential safety hazards.",
      "Develop and implement innovative methods for identifying and analyzing latent safety threats.",
      "Lead initiatives to improve the reporting and analysis of patient safety incidents.",
      "Design evidence-based interventions to mitigate risk.",
      "Propose system-level solutions to address opportunities for improvement.",
      "Propose quality improvement projects related to patient safety.",
      "Lead the implementation and evaluation of complex patient safety interventions.",
      "Disseminate scholarly findings on innovative patient safety interventions through peer-reviewed publications and presentations.",
      "Evaluate emergency preparedness system-level plans to protect safety.",
      "Assess the effectiveness of emergency response systems in maintaining patient safety during critical events.",
      "Identify areas for improvement in emergency preparedness and response related to patient safety.",
      "Advocate for policy changes to improve the safety and resilience of healthcare systems during emergencies.",
      "Contribute to a culture of provider and work environment safety.",
      "Identify actual and potential level of risks to providers within the workplace.",
      "Demonstrate awareness of potential workplace hazards in clinical settings.",
      "Seek information about workplace safety protocols and procedures.",
      "Report observed safety hazards to appropriate personnel.",
      "Conduct a thorough workplace safety assessment within a clinical setting.",
      "Develop and implement strategies to mitigate identified workplace hazards.",
      "Educate peers on identified workplace safety risks and preventative measures.",
      "Recognize how to prevent workplace violence and injury.",
      "Identify factors that may contribute to workplace violence and injury.",
      "Describe strategies for preventing workplace violence and injury.",
      "Demonstrate de-escalation techniques when interacting with agitated patients or colleagues.",
      "Utilize safe patient handling techniques to prevent injury.",
      "Maintain a safe working environment.",
      "Promote policies for prevention of violence and risk mitigation.",
      "Adhere to all workplace safety policies and procedures.",
      "Participate in safety rounds and discussions related to workplace safety.",
      "Suggest practical solutions to improve workplace safety within the clinical setting.",
      "Advocate for improved workplace safety policies and procedures within a healthcare setting.",
      "Recognize one’s role in sustaining a just culture reflecting civility and respect.",
      "Treat patients, visitors, staff, and peers with respect and professionalism.",
      "Communicate concerns and issues constructively and assertively.",
      "Demonstrate empathy and compassion towards colleagues.",
      "Recognize and address incivility or bullying through using professional and respectful communication, documenting, and reporting incidents per institutional policies, engaging in conflict resolution strategies, and advocating for a culture of respect in the workplace.",
      "Model professional behavior to foster a positive work environment.",
      "Advocate for structures, policies, and processes that promote a culture of safety and prevent workplace risks and injury.",
      "Analyze evidence on effective workplace safety interventions.",
      "Develop and advocate for policy changes to improve workplace safety within a healthcare organization.",
      "Collaborate with interprofessional teams to design and implement system-wide safety initiatives.",
      "Evaluate workplace safety programs.",
      "Disseminate resources for improving safety and health in the workplace.",
      "Foster a just culture reflecting civility and respect.",
      "Propose interventions to address workplace incivility and bullying within healthcare organizations.",
      "Facilitate discussions on workplace incivility and bullying and develop strategies for addressing these issues.",
      "Mentor junior colleagues on professional communication and interpersonal skills.",
      "Lead initiatives to promote a culture of civility and respect within a healthcare setting.",
      "Serve as a mentor or coach to create a respectful and supportive work environment.",
      "Create a safe and transparent culture for reporting incidents.",
      "Evaluate the effectiveness of existing workplace safety reporting systems and recommend improvements.",
      "Communicate findings from workplace safety investigations to relevant stakeholders.",
      "Develop and advocate strategies to improve incident reporting, investigation techniques, and protections against retaliation in the workplace.",
      "Develop strategies for collecting and analyzing workplace safety data.",
      "Disseminate findings on workplace safety incident reporting and analysis to the broader healthcare community.",
      "Role model and lead well-being and resiliency for self and team.",
      "Demonstrate healthy coping mechanisms and self-care strategies to manage stress.",
      "Promote and support the well-being and resiliency of self and colleagues within the healthcare team.",
      "Implement an initiative or activity to promote the well-being and resiliency of healthcare professionals.",
      "Advocate for policies and programs supporting health care professionals' mental and physical health."
    ],
    "source_file": "Domain-5-Progression-Indicators-Both.pdf"
  },
  {
    "domain_name": "Domain 2: Person -Centered Care",
    "progression_indicators": [
      "Engage with the individual in establishing a caring relationship.",
      "Demonstrate qualities of empathy.",
      "Listen to patients using verbal and nonverbal cues to understand their needs and concerns.",
      "Use simple, person-centered language when explaining procedures or plans of care.",
      "Use open-ended questions to elicit patient values and preferences, documenting them accurately in the medical record.",
      "Anticipate patients’ needs based on non-verbal cues and the clinical context, responding with appropriate emotional and clinical support.",
      "Leverage communication skills to elicit verbal and nonverbal information to inform the plan of care.",
      "Ensure patient preferences are consistently revisited and reflected in interdisciplinary team discussions.",
      "Demonstrate compassionate care.",
      "Demonstrate presence through eye contact, active listening, and appropriate verbal/nonverbal actions.",
      "Identify individual preferences to begin incorporating them into actions and conversations.",
      "Remain fully present even in high-stakes or emotionally charged situations.",
      "Integrate individual patient preferences and emotional support into every interaction.",
      "Engage with healthcare team members to create a seamless, person-centered care experience, respecting holistic needs.",
      "Establish mutual respect with the individual and family.",
      "Use clear, patient-centered language and encourage patients to ask questions and clarify misunderstandings.",
      "Identify culture, values, beliefs, background, and developmental needs.",
      "Seek input and affirmation from the patient and significant others.",
      "Adjust communication approaches in real-time as needed, ensuring concerns from the patient and their significant others are addressed.",
      "Integrate understanding of patients and significant others into actions and conversations.",
      "Engage family members or other key support individuals in conversations to ensure understanding and two-way communication.",
      "Promote caring relationships to effect positive outcomes.",
      "Demonstrate active listening, understanding, therapeutic communication, support, and trust in the context of holistic care.",
      "Adjust the care environment to align with patient and significant others' preferences, ensuring emotional and physical comfort while involving them in holistic care decisions.",
      "Foster caring relationships.",
      "Engage with patients to explore questions and concerns, using open-ended questions to gain a comprehensive view of their situation.",
      "Validate others' experiences and emotions in health care.",
      "Build trust by maintaining eye contact and acknowledging concerns with appropriate verbal and non-verbal affirmations to demonstrate understanding and relatability in patient interactions.",
      "Use patient concerns and situations to individualize holistic care.",
      "Tailor interventions to respect the cultural, ethical, and spiritual preferences of patients and families.",
      "Communicate effectively with individuals.",
      "Demonstrate relationship-centered care.",
      "Use therapeutic communication strategies and demonstrate empathy when interacting with patients, families, and caregivers, ensuring clear and respectful communication.",
      "Collaborate with patients and other healthcare team members to identify patient preferences, values, and cultural considerations without making assumptions.",
      "Contribute to team discussions by sharing insights from patient interactions to support a holistic care approach.",
      "Integrate patients’ cultural, emotional, and social needs into care plans.",
      "Facilitate patient autonomy by involving them in decision-making and providing relevant resources to support informed choices.",
      "Advocate for the patient’s needs and preferences within the care team, ensuring they are reflected in care decisions.",
      "Consider individual beliefs, values, and personalized information in communications.",
      "Acknowledge patients' beliefs, values, and cultural practices during care.",
      "Incorporate patient preferences into communication.",
      "Apply cultural humility and cultural competence in care discussions, fostering mutual understanding and respect.",
      "Resolve potential misunderstandings with cultural humility, mitigating implicit biases.",
      "Use a variety of communication modes appropriate for the context.",
      "Identify standard communication methods to share and receive information effectively with patients and team members.",
      "Adjust communication style based on the needs of patients.",
      "Demonstrate respect and professionalism when communicating with diverse individuals.",
      "Apply appropriate communication methods to share clear and comprehensive information tailored to diverse healthcare settings.",
      "Customize communication approaches to align with the patient's needs to ensure understanding.",
      "Demonstrate skills in interdisciplinary communication, fostering effective teamwork and mutual understanding.",
      "Demonstrate the ability to conduct sensitive or difficult conversations.",
      "Prepare for sensitive conversations by reviewing relevant patient information and considering cultural and emotional factors affecting the interaction.",
      "Use empathetic language and demonstrate active listening, ensuring patients or families feel heard and understood.",
      "Convey information clearly and respectfully, using simple language to discuss complex topics while ensuring comprehension.",
      "Create an environment fostering trust, privacy, and emotional safety, ensuring patients and families feel comfortable expressing their thoughts and concerns.",
      "Handle conversations involving conflicting perspectives or heightened emotions with professionalism and composure, focusing on the patient’s needs and goals.",
      "Utilize reflection, validation, and de-escalation techniques to navigate sensitive or emotionally charged topics effectively.",
      "Use evidence-based patient teaching materials, considering health literacy, vision, hearing, and cultural sensitivity.",
      "Identify and select evidence-based education materials aligning with the patient’s health literacy levels and preferences.",
      "Demonstrate cultural humility by selecting materials that are respectful and relevant to the patient’s cultural background and values.",
      "Ensure understanding by asking open-ended questions and encouraging patients to repeat key information in their own words.",
      "Tailor evidence-based teaching materials to meet individual patients' or families' specific educational needs, cultural context, and preferences.",
      "Anticipate and address barriers to understanding using interpreters and/or culturally appropriate resources.",
      "Demonstrate emotional intelligence in communications.",
      "Identify and respond appropriately to verbal and non-verbal emotional expressions from patients, families, and team members.",
      "Identify appropriate strategies to deliver bad news.",
      "Demonstrate self-awareness and self-regulation while communicating.",
      "Lead sensitive discussions confidently and tactfully, ensuring all parties feel respected and supported.",
      "Demonstrate advanced communication skills and techniques using a variety of modalities with diverse audiences.",
      "Use advanced communication strategies to communicate ideas.",
      "Demonstrate accuracy and clarity in electronic and written documentation, ensuring information is accessible and actionable for interdisciplinary teams.",
      "Solicit and integrate patient, family, and team feedback to refine communication approaches and enhance mutual understanding.",
      "Lead interdisciplinary discussions by employing advanced facilitation skills, ensuring alignment with objectives, and fostering team collaboration.",
      "Leverage advanced technologies to enhance communication efficacy and accessibility for diverse populations.",
      "Develop and implement innovative methods to educate, inform, and engage diverse audiences, ensuring complex health information is accessible and empowering to all stakeholders.",
      "Design evidence-based, person-centered engagement materials.",
      "Identify evidence-based guidelines to develop engagement materials.",
      "Create materials using clear, concise language and visuals to accommodate health literacy levels and ensure comprehension across diverse populations.",
      "Design tailored materials integrating individual goals, values, and contexts.",
      "Implement systematic methods to evaluate the impact of materials on outcomes.",
      "Apply individualized information, such as genetic/genomic, pharmacogenetic, and environmental exposure information in the delivery of personalized health care.",
      "Explain the importance of integrating genetic/genomic, pharmacogenetic, and environmental exposure information into patient assessments and care plans.",
      "Consult with specialists to ensure accurate interpretation and application of complex data.",
      "Educate patients and others on the relevance of genetic and environmental information using clear and accessible language to promote understanding and informed decision-making.",
      "Incorporate advanced genetic/genomic, pharmacogenetic, and environmental data into comprehensive individual or system-level plans, ensuring alignment with the latest evidence-based guidelines.",
      "Utilize advanced tools and resources to optimize clinical decisions impacting patient care.",
      "Develop and deliver tailored communication strategies to explain complex genetic and environmental data to patients, families, and team members, ensuring their understanding and active participation in care decisions.",
      "Facilitate difficult conversations and disclosure of sensitive information.",
      "Deliver sensitive information clearly and compassionately, ensuring the patient, family, or team understands the content.",
      "Use empathetic verbal and nonverbal communication strategies to create a supportive and nonjudgmental environment during difficult discussions.",
      "Lead difficult conversations with diverse patients, families, and healthcare teams while acknowledging different perspectives.",
      "Address conflicts arising during difficult conversations using advanced communication skills.",
      "Integrate assessment skills in practice.",
      "Create an environment during assessment that promotes a dynamic interactive experience.",
      "Initiate assessments using professional communication to build trust and encourage open dialogue.",
      "Utilize open-ended questions to actively engage patients in sharing health history, concerns, and goals.",
      "Tailor communication to create a caring and respectful environment based on patient needs.",
      "Identify and address communication barriers by using innovative strategies and tools.",
      "Obtain a complete and accurate history in a systematic manner.",
      "Employ focused questioning techniques to gather essential information about the patient’s chief complaint, medical history, and lifestyle factors.",
      "Synthesize comprehensive histories incorporating social, behavioral, physical, and cultural influences.",
      "Use open-ended questions to encourage patients to describe their health experiences in their own words.",
      "Perform a clinically relevant, holistic health assessment.",
      "Identify and prioritize assessments addressing the patient’s immediate needs and presenting symptoms.",
      "Collect subjective and objective data to support clinical decision-making.",
      "Apply clinical judgment to determine assessment sequencing and urgency.",
      "Adjust assessment priorities in real-time based on clinical judgment and patient feedback.",
      "Prioritize assessments based on the patient’s immediate needs and presenting symptoms.",
      "Perform point of care screening/diagnostic testing (e.g., blood glucose, PO2, EKG).",
      "Follow policies and procedures when utilizing equipment and conducting point-of-care testing.",
      "Determine the necessity of point-of-care testing based on clinical indications.",
      "Identify and manage errors in point-of-care testing.",
      "Collect and handle specimens according to established policies and procedures.",
      "Distinguish between normal and abnormal health findings.",
      "Recognize and analyze normal and abnormal health findings.",
      "Consult clinical guidelines and evidence-based resources to verify deviations from normal findings.",
      "Differentiate between findings requiring urgent versus routine follow-up and communicate appropriately with healthcare team members.",
      "Identify patterns in abnormal findings and correlate them with potential underlying conditions.",
      "Use abnormal findings to prioritize interventions and refine care plans.",
      "Synthesize normal and abnormal findings in relation to the patient’s disease process.",
      "Apply nursing knowledge to gain a holistic perspective of the person, family, community, and population.",
      "Incorporate family dynamics and support systems into the assessment process.",
      "Identify community-level factors affecting holistic patient care.",
      "Analyze data trends to assess their influence on patient well-being.",
      "Integrate clinical findings with environmental and societal data to develop comprehensive, person-centered care plans.",
      "Communicate findings of a comprehensive assessment.",
      "Document accurate assessment findings in the patient’s health record.",
      "Provide patients with clear and comprehensible explanations of assessment findings to ensure their active involvement in care decisions.",
      "Communicate key findings to the healthcare team during handoffs and case discussions.",
      "Collaborate with healthcare team members to discuss and interpret findings, contributing to informed clinical decision-making.",
      "Demonstrate that one’s practice is informed by a comprehensive assessment appropriate to the functional area of advanced nursing practice.",
      "Gather assessment data relevant to the patient’s condition and advanced practice specialty.",
      "Apply advanced nursing knowledge to interpret assessment findings within specific functional areas.",
      "Synthesize and prioritize data to guide practice decisions effectively.",
      "Demonstrate clinical reasoning and decision-making skills in analyzing complex cases and refining patient care plans.",
      "Diagnose actual or potential health problems and needs.",
      "Synthesize assessment data in the context of the individual’s current preferences, situation, and experience.",
      "Obtain relevant physical assessment data from patients and other sources.",
      "Make evidence-informed decisions based on an understanding of the individual needs of the patient.",
      "Refine data continuously by integrating feedback from diverse sources and adjusting for the evolving patient status.",
      "Create a list of problems/health concerns.",
      "Identify key health concerns to generate a problem list based on assessment data from the patient and other sources.",
      "Share the problem list with the healthcare team to facilitate collaborative planning.",
      "Incorporate input from interdisciplinary team members to prioritize the problem list and integrate it into the care plan.",
      "Update the problem list as new information becomes available, ensuring its accuracy and relevance.",
      "Prioritize problems/health concerns.",
      "Organize health concerns based on immediacy and potential impact on the patient’s well-being.",
      "Consider patient preferences when prioritizing identified health problems.",
      "Analyze the interplay of multiple health concerns to anticipate and mitigate potential complications.",
      "Facilitate team discussions to ensure alignment on prioritization and care strategies.",
      "Understand and apply the results of social screening, psychological testing, laboratory data, imaging studies, and other diagnostic tests in actions and plans of care.",
      "Interpret basic diagnostic results, distinguishing normal from abnormal findings.",
      "Interpret abnormal diagnostic findings in the context of individual health status and conditions.",
      "Integrate diagnostic data into the initial plan of care, ensuring alignment with the patient’s clinical needs.",
      "Recognize the interactions between multiple diagnostic findings and their cumulative impact on patient health.",
      "Engage in interdisciplinary discussions on diagnostic findings to inform and guide care decisions.",
      "Contribute as a team member to the formation and improvement of diagnoses.",
      "Identify the etiology and underlying factors of various conditions.",
      "Communicate key findings from assessments clearly to team members.",
      "Anticipate relevant assessment and diagnostic tests for different health conditions.",
      "Provide informed recommendations regarding diagnoses to the healthcare team.",
      "Employ context-driven, advanced reasoning to the diagnostic and decision-making process.",
      "Analyze practice situations holistically using an unbiased and systematic approach.",
      "Ask targeted, evidence-based questions to assess diagnostic priorities.",
      "Recognize emerging patterns in patient data to identify potential diagnoses using advanced reasoning frameworks.",
      "Develop initial differential diagnoses aligning with the patient, system, or population context.",
      "Synthesize contextual factors into diagnostic and care decisions.",
      "Anticipate potential complications or barriers to formulate diagnoses and implement proactive strategies to address them.",
      "Reassess diagnoses and decisions based on evolving clinical evidence.",
      "Integrate advanced scientific knowledge to guide decision making.",
      "Incorporate the best available scientific evidence, clinical guidelines, and research findings into decision-making.",
      "Apply advanced scientific concepts to healthcare delivery.",
      "Seek out and integrate new scientific knowledge into practice to enhance patient care.",
      "Engage in reflective practice to evaluate decision-making processes and assess for potential biases.",
      "Develop a plan of care.",
      "Engage the individual and the team in plan development.",
      "Gather perspectives from both the patient and team members.",
      "Respectfully acknowledge the contributions of all team members to the planning process.",
      "Encourage patient participation in plan development to foster ownership and autonomy.",
      "Collaborate with the healthcare team to make informed healthcare decisions.",
      "Advocate for the patient in healthcare team planning.",
      "Organize care based on mutual health goals.",
      "Collaborate with patients and stakeholders to set achievable goals reflecting their priorities and capabilities.",
      "Organize activities logically to address prioritized goals efficiently.",
      "Implement care activities to monitor progress toward health goals, adjusting as needed.",
      "Incorporate patient feedback to refine care organization and enhance goal achievement.",
      "Prioritize care based on best evidence.",
      "Refer to the best available evidence to prioritize interventions with the most significant impact on patient outcomes.",
      "Explain the rationale for prioritized interventions.",
      "Identify necessary resources to meet goals.",
      "Synthesize short- and long-term care priorities based on patient feedback, evidence, and goals.",
      "Revise priorities as new evidence, conditions, or team input emerge.",
      "Synthesize evidence to support prioritization and decision-making.",
      "Advocate for evidence-based priorities aligning with stakeholders' needs.",
      "Incorporate evidence-based intervention to improve outcomes and safety.",
      "Identify interventions supported by clinical or policy guidelines.",
      "Ensure chosen interventions prioritize safety.",
      "Assess patient responses to interventions and adjust as needed to ensure safety and effectiveness.",
      "Implement evidence-based interventions to address complex healthcare delivery issues.",
      "Evaluate interventions for effectiveness and safety, contributing to continuous quality improvement.",
      "Apply emerging evidence and innovations to enhance patient care outcomes.",
      "Anticipate outcomes of care (expected, unexpected, and potentially adverse).",
      "Identify potential outcomes of planned interventions.",
      "Monitor for signs of adverse or unintended outcomes and take prompt action when needed.",
      "Develop plans to prevent and mitigate potential adverse outcomes.",
      "Utilize clinical reasoning to anticipate complex or unexpected outcomes of care.",
      "Demonstrate rationale for plan.",
      "Identify relevant evidence to support decision-making.",
      "Align plan of care rationales with patient preferences and values.",
      "Reflect on the plan of care rationales to ensure alignment with best practices and goals of care.",
      "Address individuals’ experiences and perspectives in designing plans of care.",
      "Explore the patient’s lived experiences and perspectives.",
      "Consider cultural, social, and emotional factors when designing care plans.",
      "Maintain an ongoing dialogue with the patient to adapt the care plan as their needs evolve.",
      "Seek opportunities to understand experiences different from one's own to ensure comprehensive care.",
      "Lead and collaborate with an interprofessional team to develop a comprehensive plan of care.",
      "Communicate clearly and effectively with the team to ensure a shared understanding of goals and interventions.",
      "Contribute to interprofessional discussions to ensure efficient collaboration and alignment with evidence-based practices.",
      "Synthesize input from all team members into a cohesive, comprehensive plan.",
      "Prioritize risk mitigation strategies to prevent or reduce adverse outcomes.",
      "Collaborate with the team to reduce patient risks and prevent harm.",
      "Educate the patient and other stakeholders on strategies to minimize risks and promote adherence to preventive measures.",
      "Lead the healthcare team in prioritizing risk mitigation strategies.",
      "Implement strategies to reduce healthcare risks through team collaboration and leadership.",
      "Develop evidence-based interventions to improve outcomes and safety.",
      "Document relevant evidence to inform intervention selection.",
      "Prioritize interventions enhancing patient safety and minimizing potential harm.",
      "Evaluate data and measure the impact of interventions on patient outcomes, safety, and satisfaction.",
      "Adjust interventions based on data and outcomes to improve effectiveness.",
      "Lead the care team in implementing strategies to optimize patient safety and outcomes.",
      "Incorporate innovations into practice when evidence is not available.",
      "Identify gaps in evidence and explore innovative approaches to improve healthcare outcomes.",
      "Communicate potential person-centered solutions in the absence of established evidence.",
      "Advocate for the adoption and evaluation of innovative use of technologies or practices.",
      "Demonstrate accountability for care delivery.",
      "Implement individualized plan of care using established protocols.",
      "Follow established protocols and guidelines to implement the plan of care accurately and efficiently, ensuring it is tailored to the patient’s needs.",
      "Coordinate with team members to ensure seamless implementation of the care plan.",
      "Anticipate and address barriers to care implementation, evaluating continuity, patient outcomes, and effectiveness.",
      "Communicate care delivery through multiple modalities.",
      "Provide concise, clear verbal updates to team members during shift handoffs and interdisciplinary meetings.",
      "Document and communicate care delivery using electronic health records (EHRs) and other digital tools.",
      "Explain care activities to the patient to ensure understanding and engagement while soliciting feedback.",
      "Use appropriate communication tools and strategies to effectively share patient care updates, ensuring clarity and collaboration across healthcare teams.",
      "Facilitate real-time communication among team members across multiple modalities to enhance care delivery.",
      "Delegate appropriately to team members.",
      "Identify tasks suitable for delegation based on the scope of practice and team members’ competencies to ensure patient safety.",
      "Provide clear instructions when delegating tasks to team members.",
      "Verify team members’ understanding of delegated tasks.",
      "Monitor delegated tasks and provide feedback as needed.",
      "Delegate tasks according to expertise and roles within the team.",
      "Foster a collaborative environment where delegation is structured and well-coordinated.",
      "Address and resolve delegation-related issues promptly and constructively.",
      "Monitor the implementation of the plan of care.",
      "Observe patient responses to care interventions and compare them to expected outcomes.",
      "Identify and address deviations from the plan promptly to maintain continuity of care.",
      "Communicate observations to the care team to support coordinated monitoring efforts.",
      "Monitor data and implement interventions to mitigate potential complications.",
      "Incorporate feedback from patients and team members to refine the care plan.",
      "Model best care practices to the team.",
      "Analyze evidence-based protocols and best practices during care implementation.",
      "Implement evidence-based practices.",
      "Advocate for evidence-based and best practices in healthcare delivery.",
      "Seek and incorporate constructive feedback from peers and supervisors to foster continuous learning and improvement.",
      "Apply best care practices within the team, ensuring alignment with current evidence.",
      "Address gaps in team practices, suggesting actionable improvements to enhance care quality.",
      "Monitor aggregate metrics to assure accountability for care outcomes.",
      "Share relevant data trends and metrics with team members to promote awareness of care outcomes and suggest potential improvements.",
      "Compare care outcomes against institutional or national benchmarks to assess performance.",
      "Develop and implement action plans to address identified gaps in care outcomes based on metric analysis.",
      "Promote delivery of care that supports practice at the full scope of education.",
      "Demonstrate an understanding of the roles and capabilities of all team members, ensuring their full utilization within the care team.",
      "Validate care delivery alignment with institutional policies and professional standards.",
      "Advocate for team members’ ability to practice at their full scope of education and training.",
      "Participate in reviewing and refining policies to support full-scope practice within the care team.",
      "Contribute to the development of policies and processes that promote transparency and accountability.",
      "Provide constructive feedback on policies and processes to enhance transparency and accountability.",
      "Identify and address ethical implications in care policies to promote fairness and transparency.",
      "Collaborate with key stakeholders to ensure policies reflect person-centered care principles.",
      "Evaluate the effectiveness of policies and propose evidence-based improvements.",
      "Apply current and emerging evidence to the development of care guidelines/tools.",
      "Use current literature to identify gaps in existing care guidelines by analyzing current literature and opportunities, recognizing areas for improvement.",
      "Collaborate with interdisciplinary teams to review emerging evidence and adjust care tools accordingly.",
      "Lead the integration of current and emerging research into evidence-based care guidelines to enhance patient-centered care.",
      "Evaluate the effectiveness of implemented care tools by analyzing patient outcomes and refining guidelines based on emerging evidence.",
      "Advocate for including diverse, high-quality evidence from interdisciplinary fields to develop culturally competent, individualized care tools.",
      "Ensure accountability throughout transitions of care across the health continuum.",
      "Provide comprehensive handoffs during transitions of care using standardized communication tools.",
      "Develop follow-up plans to ensure continuity of care post-transition.",
      "Keep all relevant team members informed about transitions to prevent gaps in care.",
      "Implement transition plans anticipating and mitigating risks across the care continuum.",
      "Manage transitions effectively, ensuring all roles are clearly defined and executed.",
      "Evaluate outcomes of care.",
      "Reassess the individual to evaluate health outcomes/goals.",
      "Conduct routine reassessments to evaluate progress toward health goals.",
      "Compare current findings with baseline data to identify changes in the individual’s condition.",
      "Share reassessment results with the healthcare team to facilitate coordinated evaluation and decision-making.",
      "Integrate physical, emotional, social, and cultural factors into reassessments to comprehensively evaluate health outcomes.",
      "Synthesize patterns and trends in reassessment data, linking them to the effectiveness of interventions.",
      "Modify plan of care as needed.",
      "Identify necessary adjustments to the plan of care based on feedback from the patient and team members.",
      "Propose changes based on clinical guidelines and emerging patient needs.",
      "Engage the individual in discussions about plan of care adjustments to align with their preferences and values.",
      "Collaborate with the interdisciplinary team to ensure care plan modifications are holistic and evidence-based.",
      "Provide a clear, evidence-supported rationale when modifying the care plan in discussions with the team or patient.",
      "Recognize the need for modifications to standard practice.",
      "Identify specific patient factors that may necessitate deviations from standard practice.",
      "Suggest potential adjustments to care practices to better suit the individual’s context and goals in collaboration with the team.",
      "Propose evidence-based alternatives based on the evaluation of current standard practices, meeting the individual’s needs.",
      "Consider ethical implications when deviating from standard practices, ensuring ethical and patient-centered decision-making.",
      "Analyze data to identify gaps and inequities in care and monitor trends in outcomes.",
      "Collect and review patient data to identify variations in care delivery and outcomes across different populations.",
      "Recognize patterns in data suggesting disparities or inconsistencies in outcomes among different groups.",
      "Engage with team members to validate observed gaps and explore their potential causes and solutions.",
      "Conduct in-depth evaluations to determine the underlying causes of gaps in care and inequities.",
      "Analyze trend data to assess the impact on healthcare outcomes.",
      "Monitor epidemiological and system-level aggregate data to determine healthcare outcomes and trends.",
      "Recognize how system-level factors impact healthcare outcomes.",
      "Utilize data analysis tools to monitor trends effectively.",
      "Present epidemiological findings on healthcare outcomes.",
      "Engage with the team to interpret epidemiological and system-level data and develop strategies to address emerging trends.",
      "Synthesize outcome data to inform evidence-based practice, guidelines, and policies.",
      "Gather and organize outcome data to identify key findings relevant to practice and policy.",
      "Evaluate the quality and applicability of outcome data to current evidence-based practices, identifying areas where updates or refinements may be necessary.",
      "Translate complex outcome data into actionable insights for practice improvement and policy development.",
      "Advocate for system-wide adoption of practices informed by synthesized data to enhance patient outcomes.",
      "Monitor the implementation of evidence-based guidelines and evaluate their impact, refining practices as needed.",
      "Promote self-care management.",
      "Assist the individual to engage in self-care management.",
      "Provide step-by-step instructions and demonstrations for specific self-care activities.",
      "Communicate ways individuals can take small, achievable steps toward self-care independence using positive reinforcement.",
      "Assess the patient’s ability to perform self-care tasks, offering assistance and support as needed.",
      "Design personalized self-care management plans aligned with the individual’s health goals and lifestyle, adjusting the plan as needed.",
      "Support individuals in making informed decisions and encourage ownership of their self-care practices.",
      "Help individuals identify and overcome barriers to effective self-care.",
      "Collaborate with families or caregivers to support the individual’s self-care efforts in a coordinated and sustainable manner.",
      "Employ individualized educational strategies based on learning theories, methodologies, and health literacy.",
      "Identify the individual’s preferred learning style, literacy level, and learning readiness.",
      "Use plain language and visual aids to convey complex health information effectively.",
      "Employ standard educational materials and strategies to enhance understanding.",
      "Develop individualized educational plans informed by learning theories and methodologies.",
      "Adapt materials and approaches to align with the individual’s developmental stage, cultural background, and values.",
      "Assess the effectiveness of educational strategies and adjust them as needed to support self-care.",
      "Educate individuals and families regarding self-care for health promotion, illness prevention, and illness management.",
      "Provide clear, step-by-step instructions for health promotion and illness prevention practices.",
      "Distribute valid and reliable educational materials to support understanding of self-care practices.",
      "Develop comprehensive education plans addressing health promotion, prevention, and disease management.",
      "Incorporate the latest research, guidelines, and cultural considerations into educational content for individuals and families.",
      "Respect individuals and families’ self-determination in their healthcare decisions.",
      "Honor the individual’s right to make healthcare decisions, even when they differ from professional recommendations.",
      "Use empathetic and nonjudgmental language when discussing healthcare choices.",
      "Ensure individuals and families have all the necessary information to make informed decisions.",
      "Advocate for the individual’s and family’s right to self-determination.",
      "Reflect on personal biases to ensure respect for diverse perspectives in healthcare decisions.",
      "Identify personal, system, and community resources available to support self-care management.",
      "Guide individuals and families to access healthcare resources.",
      "Identify when additional resources or referrals are needed to support self-care management.",
      "Create personalized resource plans integrating personal, system, and community assets.",
      "Advocate for expanded access to resources to address gaps in care and support.",
      "Develop strategies that promote self-care management.",
      "Conduct comprehensive assessments to identify self-care management needs and barriers.",
      "Design individualized, evidence-based self-care strategies that align with the patient’s preferences, goals, and capabilities.",
      "Develop multi-faceted self-care strategies integrating behavioral, clinical, and environmental components.",
      "Align evidence-based self-care strategies with broader care plans to ensure continuity of care.",
      "Incorporate the use of current and emerging technologies to support self-care management.",
      "Provide instructions for using self-care technologies effectively and safely.",
      "Assess selected technologies to align with the individual’s technical skills and access.",
      "Explain the benefits and limitations of using technology for self-care management.",
      "Utilize technology for self-care management based on the patient’s needs and preferences.",
      "Monitor the impact of technology use on self-care behaviors and health outcomes, adjusting as needed.",
      "Employ counseling techniques, including motivational interviewing, to advance wellness and self-care management.",
      "Demonstrate active listening and empathetic responses during counseling sessions.",
      "Describe counseling techniques.",
      "Identify barriers to self-care and develop strategies to address them.",
      "Utilize comprehensive counseling strategies integrating multiple therapeutic techniques to advance wellness and self-care management.",
      "Apply effective counseling techniques, adjusting strategies based on individual responses.",
      "Manage resistance or ambivalence during counseling, fostering trust and collaboration.",
      "Evaluate adequacy of resources available to support self-care management.",
      "Identify existing personal, community, and system resources available to the patient for self-care management.",
      "Recognize limitations in available resources that may hinder effective self-care.",
      "Conduct thorough resource adequacy assessments to promote self-care and address gaps as needed.",
      "Foster partnerships with community organizations to support self-care management.",
      "Identify community organizations aligning with the patient’s self-care needs.",
      "Maintain accurate records of community partnerships utilized in care planning.",
      "Establish partnerships with community organizations to enhance self-care support networks.",
      "Assess the impact of community partnerships on patient self-care outcomes and identify areas for improvement.",
      "Provide care coordination.",
      "Facilitate continuity of care based on assessment of assets and needs.",
      "Identify the individual’s care needs, available resources, and potential barriers to continuity during transitions.",
      "Participate in follow-up care to support seamless transitions and ensure all stakeholders are informed.",
      "Develop continuity supportive plans of care addressing immediate needs and long-term goals, integrating input from the individual and their family.",
      "Collaborate with the care team to align continuity efforts and ensure a smooth handoff.",
      "Communicate with relevant stakeholders across health systems.",
      "Identify appropriate communication tools and techniques to support continuity of care.",
      "Communicate effectively with stakeholders through multiple modalities to ensure seamless care transitions.",
      "Promote collaboration by clarifying responsibilities among individual, family, and team members.",
      "Identify the roles and responsibilities of each care team member to the patient and family.",
      "Communicate each care team member's roles and responsibilities to facilitate care coordination.",
      "Monitor the effectiveness of team collaboration and refine actions as needed to clarify roles.",
      "Recognize when additional expertise and knowledge is needed to manage the patient.",
      "Acknowledge when additional expertise is required and seek assistance as needed.",
      "Utilize available resources and services to access the necessary expertise.",
      "Provide coordination of care of individuals and families in collaboration with care team.",
      "Facilitate communication and coordination among team members to ensure consistency in care delivery.",
      "Identify and organize resources needed to support individuals and families during care transitions.",
      "Track the effectiveness of care coordination efforts and make necessary adjustments to improve outcomes.",
      "Maintain clear and updated documentation of care coordination efforts in the patient’s health record.",
      "Evaluate communication pathways among providers and others across settings, systems, and communities.",
      "Utilize communication pathways among providers, systems, and community organizations to support patient care coordination.",
      "Assess the efficiency and clarity of current communication processes through observation and feedback.",
      "Recognize common barriers to effective communication and develop strategies to address them.",
      "Critically analyze communication pathways, considering technological, interpersonal, and systemic factors.",
      "Propose actionable recommendations to optimize communication pathways across diverse care settings.",
      "Develop strategies to optimize care coordination and transitions of care.",
      "Identify gaps in current care coordination processes during transitions of care.",
      "Ensure strategies align with available resources, evidence-based practices, support services, and technological tools.",
      "Leverage advanced tools and technologies to enhance care coordination and transitions.",
      "Test strategies to evaluate feasibility and impact before broader application.",
      "Guide the coordination of care across health systems.",
      "Facilitate communication and collaboration among providers across different systems.",
      "Validate that care coordination efforts prioritize patient goals and preferences.",
      "Gather feedback on the coordination process to identify areas for improvement.",
      "Engage with cross-system teams to coordinate care for complex cases, ensuring consistency and alignment.",
      "Track and analyze care coordination outcomes to refine processes and enhance efficiency.",
      "Guide peers and teams in adopting best practices for cross-system care coordination.",
      "Analyze system-level and public policy influence on care coordination.",
      "Demonstrate an understanding of how public policies and system-level regulations affect care coordination.",
      "Use data to assess the impact of system-level factors on care coordination outcomes.",
      "Develop recommendations based on data analysis to inform policy and organizational decision-making.",
      "Monitor and evaluate the ongoing impact of system-level and policy changes on care coordination.",
      "Participate in system-level change to improve care coordination across settings.",
      "Contribute to proposals for system-level changes aimed at improving care coordination.",
      "Engage stakeholders in discussions about the benefits and challenges of proposed changes.",
      "Support efforts to track the impact of system-level changes on care coordination.",
      "Develop plans for sustainable improvements in care coordination at the organizational level.",
      "Utilize systems to monitor the impact of implemented changes and refine strategies."
    ],
    "source_file": "Domain-2-Progression-Indicators-Both.pdf"
  },
  {
    "domain_name": "Domain 1: Knowledge for Nursing Practice",
    "progression_indicators": [
      "Demonstrate an understanding of the discipline of nursing’s distinct perspective and where shared perspectives exist with other disciplines.",
      "Identify concepts, derived from theories from nursing and other disciplines which distinguish the practice of nursing.",
      "Describe fundamental nursing theories and concepts that differentiate nursing from other healthcare disciplines.",
      "Explain how theoretical concepts guide practice.",
      "Explain nursing and interdisciplinary theories, highlighting their contributions to nursing practice and identifying how they distinguish nursing from other healthcare professions.",
      "Develop and implement plans of care that integrate theoretical concepts from nursing and other relevant disciplines.",
      "Apply knowledge of nursing science that develops a foundation for nursing practice.",
      "Discuss relevant research findings and their application in supporting nursing interventions.",
      "Integrate nursing science into clinical decision-making by accurately assessing patient conditions and formulating evidence-based plans of care.",
      "Understand the historical foundation of nursing as the relationship developed between the individual and nurse.",
      "Discuss the impact of key historical figures and their contributions to developing the nursing relationship.",
      "Describe major historical events influencing nursing’s evolution and how these events have shaped current nurse-patient interactions.",
      "Incorporate parallels between historical nursing practices and contemporary approaches to patient care and practice situations.",
      "Articulate nursing's distinct perspective to practice.",
      "Identify core nursing values and explain how they shape the nursing approach, distinguishing it from other health professions.",
      "Explain how empathy, active listening, and culturally responsive care foster a deeper nursing-patient connection.",
      "Explain how nursing’s emphasis on holistic care differentiates it from other healthcare disciplines.",
      "Apply current, peer-reviewed nursing science and evidence-based practice guidelines to justify and inform nursing practice.",
      "Employ empathy, active listening, and culturally responsive care while interacting with patients.",
      "Translate evidence from nursing sciences as well as other sciences into practice.",
      "Explore relevant literature to identify evidence applicable to nursing practice.",
      "Perform initial evidence appraisal by summarizing key findings from selected nursing and other scientific disciplines.",
      "Adjust practice decisions based on evidence collected through research from nursing and interdisciplinary sciences.",
      "Design and implement interventions integrating evidence from nursing and other sciences to improve patient outcomes.",
      "Demonstrate the application of nursing science to practice.",
      "Identify gaps in practice that impact care delivery and care outcomes.",
      "Articulate the underlying nursing science principles guiding patient care.",
      "Analyze current clinical practices and integrate nursing science into practice to address identified gaps, evaluating patient and care-related outcomes.",
      "Integrate an understanding of nursing history in advancing nursing's influence in health care.",
      "Identify significant historical events or leaders in nursing and discuss their impact on the profession and healthcare systems.",
      "Describe nursing’s role in shaping modern healthcare systems.",
      "Draw from nursing history to analyze current practices and propose solutions to contemporary healthcare challenges.",
      "Advocate for nursing’s influence in shaping healthcare systems and policies.",
      "Apply theory and research-based knowledge from nursing, the arts, humanities, and other sciences.",
      "Apply or employ knowledge from nursing science as well as the natural, physical, and social sciences to build an understanding of the human experience and nursing practice.",
      "Explore knowledge from the natural and social sciences to identify health and illness patterns.",
      "Identify physical, emotional, and environmental factors influencing the patient's health and experiences.",
      "Integrate scientific knowledge with nursing principles to justify clinical decisions.",
      "Develop care plans incorporating cultural, physical, environmental, and psychosocial considerations.",
      "Demonstrate intellectual curiosity.",
      "Explore topics relevant to patient care and discuss findings with peers and mentors.",
      "Question healthcare practices and seek supporting rationale.",
      "Seek and evaluate evidence to support patient care.",
      "Identify and address personal knowledge gaps through education, experiences, or mentorship.",
      "Demonstrate social responsibility as a global citizen who fosters the attainment of health equity for all.",
      "Identify health disparities and the impact of social determinants on patient outcomes locally and globally.",
      "Show respect for diverse beliefs and practices in patient interactions.",
      "Apply knowledge of health equity principles to advocate for diverse patient populations.",
      "Propose strategies to reduce barriers to care at both individual and community levels.",
      "Examine influence of personal values in decision-making for nursing practice.",
      "Recognize potential biases and take steps to mitigate their impact, seeking guidance as needed.",
      "Describe how individual values influence clinical decision-making for the healthcare team and patients.",
      "Collaborate with healthcare teams to address conflicts between personal values and professional responsibilities.",
      "Demonstrate ethical decision-making.",
      "Identify ethical principles relevant to nursing practice and professional ethical guidelines.",
      "Describe ethical dilemmas in patient care, integrating ethical frameworks to guide decision-making.",
      "Incorporate rationale related to ethical decisions into practice.",
      "Collaborate with interprofessional teams to analyze and address ethical dilemmas, advocating for patient rights, autonomy, and well-being.",
      "Synthesize knowledge from nursing and other disciplines to inform education, practice, and research.",
      "Discuss connections between advanced nursing practice and related disciplines, illustrating how interdisciplinary knowledge enhances nursing practice.",
      "Reflect on how integrating diverse knowledge from various fields contributes to advanced nursing practice.",
      "Demonstrate in practice the use of knowledge from nursing and other disciplines.",
      "Analyze how the integration of nursing and other disciplinary knowledge impacts one’s practice and practice outcomes.",
      "Apply a systematic and defendable approach to nursing practice decisions.",
      "Explore decision-making frameworks and their applications as guides in advanced nursing practice.",
      "Utilize an evidence-based approach to inform decision-making that aligns with healthcare quality standards.",
      "Collaborate to analyze and refine decision-making approaches, fostering an environment of shared learning and continuous improvement.",
      "Defend clinical and ethical decisions with well-supported rationales grounded in nursing evidence, professional standards, and core nursing values, ensuring accountability and high-quality patient care.",
      "Employ ethical decision making to assess, intervene, and evaluate nursing care.",
      "Discuss ethical dilemmas in practice.",
      "Utilize ethical frameworks from nursing or social sciences to assess practice situations, guiding interventions and evaluations.",
      "Evaluate nursing practice outcomes using a justified ethical framework.",
      "Take accountability for ethical decisions by reflecting on their impact on client or population outcomes.",
      "Demonstrate socially responsible leadership.",
      "Discuss the importance of social responsibility in nursing leadership.",
      "Examine the impact of social issues on clients, populations, and nursing practice.",
      "Promote practices that ensure equity, respect, and person-centeredness in healthcare.",
      "Use leadership skills to advocate for vulnerable populations, ensuring resources are accessible to all clients, regardless of social status.",
      "Translate theories from nursing and other disciplines to practice.",
      "Apply nursing theories and frameworks to guide clinical decision-making contextually.",
      "Connect theoretical concepts to practice settings, making the connection between nursing frameworks and real-world clinical experiences.",
      "Improve patient care by integrating knowledge from various disciplines.",
      "Develop innovative solutions for healthcare challenges by utilizing nursing and interdisciplinary theories.",
      "Demonstrate clinical judgment founded on a broad knowledge base.",
      "Demonstrate clinical reasoning.",
      "Identify key patient problems and articulate the nursing knowledge and logical steps for clinical decisions.",
      "Recognize gaps in knowledge that affect clinical decisions and use appropriate resources to support sound clinical judgments during clinical rotations or simulations.",
      "Re-prioritize patient problems based on changes in the patient's condition and severity, initiating appropriate interventions promptly to prevent complications and improve outcomes during clinical practice.",
      "Develop and revise a comprehensive patient plan of care, incorporating a critical analysis of changes in the patient's condition, integrating new clinical information, and adjusting interventions to optimize patient outcomes.",
      "Integrate nursing knowledge (theories, multiple ways of knowing, evidence) and knowledge from other disciplines and inquiry to inform clinical judgment.",
      "Identify how different nursing theories and evidence-based guidelines can be used to develop and implement plans of care that address different patient needs and preferences.",
      "Discuss and evaluate how nursing knowledge informs clinical judgments.",
      "Apply relevant nursing theories and evidence-based guidelines to develop and implement plans of care tailored to the individual patient’s unique needs and preferences.",
      "Incorporate feedback into clinical decision making.",
      "Incorporate knowledge from nursing and other disciplines to support clinical judgment.",
      "Describe how patient and environmental factors influence clinical decision-making.",
      "Provide an evidence-based rationale for adjusting plans of care to reflect contextual challenges and opportunities.",
      "Integrate patient and environmental factors into the decision-making process.",
      "Incorporate knowledge of cultural, ethical, and legal considerations into one’s clinical reasoning to make informed clinical judgments.",
      "Integrate foundational and advanced specialty knowledge into clinical reasoning.",
      "Identify patient problems and propose interventions using foundational and advanced specialty concepts.",
      "Identify areas of strength and opportunities for improvement for integrating foundational and advanced specialty knowledge while making clinical decisions.",
      "Analyze data and outcomes by applying clinical reasoning and integrating evidence to develop or revise guidelines or practice plans.",
      "Apply foundational and specialty knowledge to decision-making when managing complex cases or addressing challenges identified in practice.",
      "Articulate the rationale for clinical decisions, linking foundational science and advanced specialty knowledge to care outcomes.",
      "Synthesize current and emerging evidence to influence practice.",
      "Summarize findings from research articles, clinical guidelines, or quality improvement reports that inform practice.",
      "Incorporate emerging evidence and rationale into plans of care, action plans, or interventions.",
      "Appraise and integrate quality research, clinical guidelines, and other forms of evidence to address care challenges.",
      "Propose and test practice changes or innovations using recent findings from research, quality improvement projects, or technological advancements.",
      "Analyze decision models from nursing and other knowledge domains to improve clinical judgment.",
      "Discern the applicability and appropriateness of decision-making frameworks in practice.",
      "Utilize appropriate decision models to analyze patient care situations in clinical practice.",
      "Assess the impact of applied decision models on patient care quality, safety, and efficiency."
    ],
    "source_file": "Domain-1-Progression-Indicators-Both.pdf"
  },
  {
    "domain_name": "Domain 4: Scholarship for the Nursing Discipline",
    "progression_indicators": [
      "Demonstrate an understanding of different approaches to scholarly practice.",
      "Describe research methods.",
      "Compare and contrast different scholarly practices.",
      "Use evaluation criteria to appraise literature.",
      "Demonstrate application of different levels of evidence.",
      "Explain the different levels of evidence.",
      "Categorize publications by level of evidence.",
      "Apply different levels of evidence to clinical decision-making.",
      "Appraise and synthesize evidence from multiple levels.",
      "Apply theoretical framework(s)/models in practice.",
      "Identify key theoretical frameworks/models relevant to nursing practice.",
      "Describe how specific theoretical frameworks/models apply to clinical practice.",
      "Provide a rationale for integrating chosen theoretical frameworks/models into plans of care.",
      "Evaluate the effectiveness of theoretical frameworks/models in practice through reflective practice.",
      "Demonstrate an understanding of basic elements of the research process.",
      "List the essential elements of the research process.",
      "Explain the steps of the research process.",
      "Design a simple research study, including all essential elements.",
      "Participate in scholarly inquiry as a team member.",
      "Share expertise and listen to diverse perspectives in group discussions about scholarly inquiry.",
      "Make meaningful contributions to enhance the quality of team-based scholarly projects or assignments.",
      "Evaluate research.",
      "Identify key components of research.",
      "Critique research for strengths and weaknesses.",
      "Synthesize findings from research to draw reasonable conclusions.",
      "Evaluate research in a specific area of interest.",
      "Communicate scholarly findings.",
      "Summarize findings in written or oral formats.",
      "Present findings in peer group settings.",
      "Apply and critically evaluate advanced knowledge in a defined area of nursing practice.",
      "Describe advanced knowledge relevant to a specific area of nursing practice.",
      "Apply specialized knowledge to clinical practice.",
      "Evaluate the application of specialized knowledge in practice.",
      "Synthesize specialized knowledge to develop innovative solutions or improvements in practice.",
      "Engage in scholarship to advance health.",
      "Participate in scholarly activities like discussions and journal clubs.",
      "Design scholarly projects or initiatives aimed at advancing health.",
      "Lead a scholarly project or initiative, demonstrating the ability to advance health outcomes.",
      "Communicate findings from scholarly activities contributing to the advancement of health.",
      "Discern appropriate applications of quality improvement, research, and evaluation methodologies.",
      "Differentiate various quality improvement, research, and evaluation methodologies.",
      "Apply appropriate methodologies to address specific clinical or research questions.",
      "Evaluate the effectiveness of different methodologies in achieving desired outcomes.",
      "Develop and implement evidence-based projects using sophisticated analytical and interpretive methodologies.",
      "Collaborate to advance one’s scholarship.",
      "Engage in collaborative discussions with peers and mentors about scholarly work.",
      "Participate in collaborative research or scholarly projects.",
      "Lead collaborative efforts in research or scholarly projects, demonstrating effective teamwork.",
      "Collaborate with the interprofessional team to enhance and sustain the impact of scholarly work.",
      "Disseminate one’s scholarship to diverse audiences using a variety of approaches or modalities.",
      "Evaluate appropriate modalities and audiences for dissemination of scholarly work.",
      "Disseminate scholarly work to professional audiences through publications, conferences, or webinars.",
      "Advocate within the interprofessional team and with other stakeholders for the contributions of nursing scholarship.",
      "Articulate the importance of nursing scholarship in team meetings or discussions.",
      "Advocate for the inclusion of nursing scholarship in interprofessional projects or initiatives.",
      "Engage with external stakeholders to promote and advocate for the value of nursing scholarship in improving health outcomes.",
      "Evaluate clinical practice to generate questions to improve nursing care.",
      "Evaluate alignment of clinical practice with evidence-based guidelines.",
      "Generate focused, relevant questions to improve nursing care.",
      "Evaluate appropriateness and strength of the evidence.",
      "Explain the different types of evidence and their sources.",
      "Assess the quality and relevance of evidence for specific clinical questions.",
      "Appraise the strength and applicability of evidence in clinical decision-making.",
      "Synthesize evidence from multiple sources to improve practice.",
      "Use best evidence in practice.",
      "Identify the best evidence relevant to clinical practice.",
      "Integrate best evidence into clinical practice to improve patient outcomes.",
      "Evaluate the impact of using the best evidence on patient care and outcomes.",
      "Participate in the implementation of a practice change to improve nursing care.",
      "Engage in discussions about potential practice changes.",
      "Recommend a practice change based on evidence.",
      "Demonstrate the implementation process for a practice change.",
      "Participate in the evaluation of outcomes and their implications for practice.",
      "Examine data on patient outcomes following practice changes.",
      "Analyze data to determine the effectiveness of practice changes.",
      "Evaluate the implications of outcomes for future practice.",
      "Disseminate findings from outcome evaluations to inform and improve nursing practice.",
      "Use diverse sources of evidence to inform practice.",
      "Appraise multiple sources of evidence.",
      "Synthesize evidence from diverse sources to inform practice.",
      "Incorporate diverse evidence into practice guidelines and protocols.",
      "Lead the translation of evidence into practice.",
      "Participate in discussions about translating evidence into practice.",
      "Develop plans to implement evidence-based changes in practice.",
      "Lead the implementation of evidence-based practice changes in clinical settings.",
      "Evaluate and refine the process of translating evidence into practice to ensure sustainability and effectiveness.",
      "Address opportunities for innovation and changes in practice.",
      "Identify areas in clinical practice that could benefit from improvement.",
      "Propose solutions to improve practice.",
      "Implement changes in practice and evaluate their impact.",
      "Mentor others in the development and implementation of practice changes.",
      "Collaborate in the development of new/revised policy or regulation in the light of new evidence.",
      "Participate in discussions about policy or regulatory changes based on new evidence.",
      "Advocate for the development of new or revised policies or regulations.",
      "Analyze the relationship between emerging evidence and its potential impact on existing policies or regulations.",
      "Evaluate the impact of policy or regulatory changes and advocate for further improvements based on evidence.",
      "Provide data-driven insights and evidence to support the development of clear, actionable policies.",
      "Articulate inconsistencies between practice policies and best evidence.",
      "Discuss inconsistencies among policies and evidence with peers and supervisors.",
      "Provide evidence-based recommendations to address inconsistencies in practice policies.",
      "Evaluate outcomes and impact of new practices based on the evidence.",
      "Collect data on the outcomes following the implementation of new practices.",
      "Analyze data to assess the impact of new practices.",
      "Evaluate the efficacy of new practices and their effect on patient outcomes.",
      "Disseminate findings from outcome evaluations to inform and improve future practice.",
      "Explain the rationale for ethical research guidelines, including Institutional Review Board (IRB) guidelines.",
      "Identify key ethical research guidelines and the role of the IRB.",
      "Explain the importance of ethical research guidelines and IRB processes in protecting participants.",
      "Apply ethical research guidelines and IRB requirements to the design of a scholarly project.",
      "Demonstrate ethical behaviors in scholarly projects including quality improvement and EBP initiatives.",
      "Describe ethical principles relevant to scholarly projects and quality improvement initiatives.",
      "Integrate ethical principles into planning and executing quality improvement or EBP initiatives.",
      "Evaluate the ethical aspects of scholarly projects and quality improvement initiatives, providing recommendations for improvement.",
      "Advocate for the protection of participants in the conduct of scholarly initiatives.",
      "Identify the rights and protections of research participants.",
      "Ensure participant protections are upheld in the conduct of scholarly initiatives.",
      "Recognize the impact of equity issues in research.",
      "Identify equity issues that may affect research outcomes.",
      "Discuss the implications of equity issues in research with peers and mentors.",
      "Evaluate research studies for equity issues and advocate for equitable research practices.",
      "Identify and mitigate potential risks and areas of ethical concern in the conduct of scholarly activities.",
      "Identify potential risks and ethical concerns in scholarly activities.",
      "Discuss strategies to mitigate identified risks and ethical concerns with peers and mentors.",
      "Implement strategies to mitigate risks and address ethical concerns in scholarly projects.",
      "Evaluate the effectiveness of mitigation strategies and make recommendations for improvement.",
      "Apply IRB guidelines throughout the scholarship process.",
      "Identify key IRB guidelines relevant to scholarly activities.",
      "Apply IRB guidelines in the planning and design of scholarly projects.",
      "Ensure compliance with IRB guidelines throughout the conduct of scholarly activities.",
      "Ensure the protection of participants in the conduct of scholarship.",
      "Advocate for participant protections in the planning and conduct of scholarly projects.",
      "Implement measures to ensure the protection of participants in scholarly activities.",
      "Implement processes that support ethical conduct in practice and scholarship.",
      "Identify processes supporting ethical conduct in practice and scholarship.",
      "Participate in the implementation of ethical processes in scholarly projects.",
      "Evaluate the effectiveness of ethical processes and recommend improvements.",
      "Apply ethical principles to the dissemination of nursing scholarship.",
      "Identify ethical principles relevant to the dissemination of nursing scholarship.",
      "Apply ethical principles in the preparation of scholarly presentations and publications.",
      "Ensure all dissemination activities adhere to ethical principles.",
      "Promote ethical dissemination practices and address any ethical issues that arise."
    ],
    "source_file": "Domain-4-Progression-Indicators-Both.pdf"
  }
]